const fakeDataServiceResult = {
    "result": {
        "currentCount": 1,
        "totalCount": 1,
        "features": {
            "type": "FeatureCollection",
            "features": [
                {
                    "type": "Feature",
                    "properties": {
                        "SMID": "1",
                        "NAME": "四川省",
                    },
                    "geometry": {
                        "type": "MultiPolygon",
                        "coordinates": [
                            [
                                [
                                    [
                                        101.84004968,
                                        26.0859968692659
                                    ],

                                    [
                                        101.95654423,
                                        26.0888446242659
                                    ],
                                    [
                                        101.84004968,
                                        26.0859968692659
                                    ]
                                ]
                            ]
                        ]
                    },
                }
            ]
        }
    }
};
// const fakeDataServiceResult =
// {'queryMode':'SpatialQuery','queryParameters':{'customParams':null,'prjCoordSys':null,'expectCount':20,'networkType':"LINE",'queryOption':"ATTRIBUTEANDGEOMETRY",'queryParams':[{'name':"Capitals@World.1",'attributeFilter':"SmID%26gt;0"}],'startRecord':0,'holdTime':10,'returnCustomResult':false,'returnFeatureWithFieldCaption':false},'geometry':{'id':0,'style':null,'parts':[5],'points':[{'id':"SuperMap.Geometry_7",'bounds':null,'SRID':null,'x':88.78538087499851,'y':21.676702703064578,'tag':null,'type':"Point",'geometryType':"Point"},{'id':"SuperMap.Geometry_8",'bounds':null,'SRID':null,'x':119.89866212499828,'y':21.676702703064578,'tag':null,'type':"Point",'geometryType':"Point"},{'id':"SuperMap.Geometry_9",'bounds':null,'SRID':null,'x':119.89866212499828,'y':49.737884922662886,'tag':null,'type':"Point",'geometryType':"Point"},{'id':"SuperMap.Geometry_10",'bounds':null,'SRID':null,'x':88.78538087499851,'y':49.737884922662886,'tag':null,'type':"Point",'geometryType':"Point"},{'id':"SuperMap.Geometry_11",'bounds':null,'SRID':null,'x':88.78538087499851,'y':21.676702703064578,'tag':null,'type':"Point",'geometryType':"Point"}],'type':"REGION",'prjCoordSys':{'epsgCode':null}},'spatialQueryMode':"INTERSECT"};

const fakeAddressMatch = {
    "result": [
        {
            "score": 80,
            "address": "北京市海淀区中关村大街59号中国人民大学",
            "location": {
                "x": 116.318029039223,
                "y": 39.969365325535
            },
            "filters": [
                "北京市",
                "海淀区"
            ]
        },
    ]
};

const fakeMapServiceResult = {
    "result": {
        "recordsets":

            [
                {
                    "datasetName": "Capitals@World#1",
                    "features": {
                        "type": "FeatureCollection",
                        "features": [
                            {
                                "type": "Feature",
                                "properties": {
                                    "SMID": "1",
                                    "NAME": "四川省",
                                },
                                "geometry": {
                                    "type": "MultiPolygon",
                                    "coordinates": [
                                        [
                                            [
                                                [
                                                    101.84004968,
                                                    26.0859968692659
                                                ],

                                                [
                                                    101.95654423,
                                                    26.0888446242659
                                                ],
                                                [
                                                    101.84004968,
                                                    26.0859968692659
                                                ]
                                            ]
                                        ]
                                    ]
                                },
                            }
                        ],
                    },
                    "fieldCaptions": [
                        "SmID",
                        "SmX",
                        "SmY",
                        "SmLibTileID",
                        "SmUserID",
                        "SmGeometrySize",
                        "USERID",
                        "POP",
                        "CAPITAL_LO",
                        "CAPITAL_CH",
                        "COUNTRY_CH",
                        "CAPITAL_EN",
                        "COUNTRY_EN",
                        "COUNTRY",
                        "CAP_POP",
                        "CAPITAL"
                    ],
                    "fieldTypes": [
                        "INT32",
                        "DOUBLE",
                        "DOUBLE",
                        "INT32",
                        "INT32",
                        "INT32",
                        "INT32",
                        "DOUBLE",
                        "WTEXT",
                        "WTEXT",
                        "WTEXT",
                        "WTEXT",
                        "WTEXT",
                        "WTEXT",
                        "DOUBLE",
                        "WTEXT"
                    ],
                    "fields": [
                        "SmID",
                        "SmX",
                        "SmY",
                        "SmLibTileID",
                        "SmUserID",
                        "SmGeometrySize",
                        "USERID",
                        "POP",
                        "CAPITAL_LO",
                        "CAPITAL_CH",
                        "COUNTRY_CH",
                        "CAPITAL_EN",
                        "COUNTRY_EN",
                        "COUNTRY",
                        "CAP_POP",
                        "CAPITAL"
                    ]
                }
            ],
        "totalCount": 1,
        "currentCount": 1,
        "customResponse": null,
        "succeed": true
    }
};


const featureResults = {
    "features": [
        {
            "stringID": null,
            "fieldNames": [
                "SMID",
                "NAME"
            ],
            "geometry": {
                "center": {
                    "x": 102.815664598142,
                    "y": 30.1731543892007
                },
                "parts": [
                    3
                ],
                "style": null,
                "prjCoordSys": null,
                "id": 1,
                "type": "REGION",
                "partTopo": [
                    1
                ],
                "points": [
                    {
                        "x": 101.84004968,
                        "y": 26.0859968692659
                    },
                    {
                        "x": 101.95654423,
                        "y": 26.0888446242659
                    },
                    {
                        "x": 101.84004968,
                        "y": 26.0859968692659
                    }
                ]
            },
            "fieldValues": [
                "1",
                "四川省"
            ],
            "ID": 1
        }
    ],
    "featureUriList": [],
    "totalCount": 1,
    "featureCount": 1
};

const datas = {
    "dataMetaInfo": null,
    "lastModfiedTime": 1552361419799,
    "fileName": "sichuan(2).geojson",
    "thumbnail": "http://192.168.12.230:8092/services/../web/static/portal/img/map/cloud.png",
    "dataItemServices": [
        {
            "serviceType": "RESTMAP",
            "accessCount": 0,
            "address": "http://192.168.12.230:8095/portalproxy/iserver/services/map_sichuan-2-/rest",
            "dataID": 1962026684,
            "createTime": null,
            "serviceStatus": "PUBLISHED",
            "editable": false,
            "updateTime": null,
            "serviceNode": "z62wol8e",
            "serviceID": "map_sichuan-2-",
            "serviceName": "map_sichuan-2-"
        },
        {
            "serviceType": "RESTDATA",
            "accessCount": 0,
            "address": "http://192.168.12.230:8095/portalproxy/iserver/services/data_sichuan-2-/rest",
            "dataID": 1962026684,
            "createTime": null,
            "serviceStatus": "PUBLISHED",
            "editable": true,
            "updateTime": null,
            "serviceNode": "z62wol8e",
            "serviceID": "data_sichuan-2-",
            "serviceName": "data_sichuan-2-"
        }
    ],
    "dataCheckResult": {
        "serviceCheckInfos": [
            {
                "serviceType": "RESTDATA",
                "checkStatus": "SUCCESS",
                "checkMsg": null,
                "dataType": "GEOJSON",
                "id": 9,
                "MD5": "c1e4a265e355de9a4aa2d5e40612285d"
            },
            {
                "serviceType": "RESTMAP",
                "checkStatus": "SUCCESS",
                "checkMsg": null,
                "dataType": "GEOJSON",
                "id": 35,
                "MD5": "c1e4a265e355de9a4aa2d5e40612285d"
            }
        ],
        "dataCheckInfo": {
            "checkStatus": "SUCCESS",
            "checkMsg": null,
            "dataType": "GEOJSON",
            "id": 9,
            "MD5": "c1e4a265e355de9a4aa2d5e40612285d"
        }
    },
    "publishInfo": null,
    "authorizeSetting": [
        {
            "aliasName": null,
            "entityRoles": null,
            "entityType": "USER",
            "entityName": "admin_123",
            "dataPermissionType": "DELETE",
            "entityId": null
        },
        {
            "aliasName": "GUEST",
            "entityRoles": null,
            "entityType": "USER",
            "entityName": "GUEST",
            "dataPermissionType": "DOWNLOAD",
            "entityId": null
        }
    ],
    "description": null,
    "userName": "admin_123",
    "type": "GEOJSON",
    "tags": [
        "用户数据"
    ],
    "coordType": null,
    "size": 7490,
    "createTime": 1552361419799,
    "serviceStatus": "PUBLISHED",
    "nickname": null,
    "id": 1962026684,
    "serviceId": null,
    "downloadCount": 0,
    "storageId": "2ari8ma4_gjd5mitu_2922171f_4f32_4c99_914b_2bbf258387e8",
    "status": "OK",
    "MD5": "c1e4a265e355de9a4aa2d5e40612285d"
};


const datas_mapjson = {
    "extent": {
        "leftBottom": {
            "x": -20037508.3427892,
            "y": -20037508.3427891
        },
        "rightTop": {
            "x": 20037508.3427892,
            "y": 20037508.3427891
        }
    },
    "level": 5,
    "center": {
        "x": 11810617.9363554,
        "y": 4275239.3340175
    },
    "baseLayer": {
        "layerType": "TILE",
        "name": "China",
        "url": "http://support.supermap.com.cn:8090/iserver/services/map-china400/rest/maps/China"
    },
    "layers": [
        {
            "layerType": "UNIQUE",
            "visible": true,
            "themeSetting": {
                "themeField": "2016起降架次（架次）",
                "customSettings": {},
                "colors": [
                    "#D53E4F",
                    "#FC8D59",
                    "#FEE08B",
                    "#FFFFBF",
                    "#E6F598",
                    "#99D594",
                    "#3288BD"
                ]
            },
            "name": "民航数",
            "featureType": "POINT",
            "style": {
                "strokeWidth": 1,
                "fillColor": "#3288bd",
                "fillOpacity": 0.9,
                "radius": 7,
                "strokeColor": "#ffffff",
                "type": "BASIC_POINT",
                "strokeOpacity": 1
            },
            "projection": "EPSG:4326",
            "enableFields": [
                "机场",
                "X坐标",
                "Y坐标",
                "名次",
                "2017旅客吞吐量（人次）",
                "2016旅客吞吐量（人次）",
                "同比增速%",
                "2017货邮吞吐量（吨）",
                "2016货邮吞吐量（吨）",
                "2017起降架次（架次）",
                "2016起降架次（架次）"
            ],
            "dataSource": {
                "type": "PORTAL_DATA",
                "serverId": "1920557079"
            }
        }
    ],
    "description": "",
    "projection": "EPSG:3857",
    "title": "unique_民航数据",
    "version": "1.0"
};

const datasources = {
    "datasourceNames": [
        "supermap1_pg"
    ],
    "childUriList": [
        "http://192.168.12.230:8095/portalproxy/iserver/services/data_sichuan-2-/rest/data/datasources/name/supermap1_pg"
    ],
    "datasourceCount": 1
}

const datasets = {
    "datasetCount": 1,
    "datasetNames": [
        "dataGeoJson_509705538"
    ],
    "childUriList": [
        "http://192.168.12.230:8095/portalproxy/iserver/services/data_sichuan-2-/rest/data/datasources/supermap1_pg/datasets/dataGeoJson_509705538"
    ]
};

const queryResults = {
    "recordsets": [
        {
            "datasetName": "Capitals@World#1",
            "features": [
                {
                    "fieldNames": [
                        "SmID",
                        "SmX",
                        "SmY"
                    ],
                    "ID": 1,
                    "fieldValues": [
                        "1",
                        "-47.8977476573595",
                        "-15.792110943058866",
                    ],
                    "geometry": {
                        "id": 1,
                        "center": {
                            "y": -15.7921109430589,
                            "x": -47.8977476573595
                        },
                        "style": null,
                        "parts": [
                            1
                        ],
                        "partTopo": [],
                        "points": [
                            {
                                "y": -15.7921109430589,
                                "x": -47.8977476573595
                            }
                        ],
                        "type": "POINT"
                    }
                }
            ],
            "fieldCaptions": [
                "SmID",
                "SmX",
                "SmY"
            ],
            "fieldTypes": [
                "INT32",
                "DOUBLE",
                "DOUBLE"
            ],
            "fields": [
                "SmID",
                "SmX",
                "SmY"
            ]
        }
    ],
    "totalCount": 1,
    "currentCount": 1,
    "customResponse": null
};

const fakeLandUse = {
    "childUriList": [
        "http://support.supermap.com.cn:8090/iserver/services/data-jingjin/rest/data/datasources/Jingjin/datasets/Landuse_R/fields",
        "http://support.supermap.com.cn:8090/iserver/services/data-jingjin/rest/data/datasources/Jingjin/datasets/Landuse_R/features",
        "http://support.supermap.com.cn:8090/iserver/services/data-jingjin/rest/data/datasources/Jingjin/datasets/Landuse_R/domain"
    ],
    "supportAttachments": true,
    "supportFeatureMetadatas": false,
    "datasetInfo": {
        "charset": "GB18030",
        "recordCount": 101,
        "isFileCache": false,
        "description": "",
        "type": "REGION",
        "dataSourceName": "Jingjin",
        "tableName": "Landuse_R",
        "isReadOnly": false,
        "encodeType": "NONE",
        "bounds": {
            "top": 41.0405421705869,
            "left": 115.438731076072,
            "bottom": 38.5673427409879,
            "leftBottom": {
                "x": 115.438731076072,
                "y": 38.5673427409879
            },
            "right": 118.071395439998,
            "rightTop": {
                "x": 118.071395439998,
                "y": 41.0405421705869
            }
        },
        "name": "Landuse_R",
        "prjCoordSys": {
            "distanceUnit": "METER",
            "projectionParam": null,
            "epsgCode": 4326,
            "coordUnit": "DEGREE",
            "name": "Longitude / Latitude Coordinate System---GCS_WGS_1984",
            "projection": null,
            "type": "PCS_EARTH_LONGITUDE_LATITUDE",
            "coordSystem": {
                "datum": {
                    "name": "D_WGS_1984",
                    "type": "DATUM_WGS_1984",
                    "spheroid": {
                        "flatten": 0.00335281066474748,
                        "name": "WGS_1984",
                        "axis": 6378137,
                        "type": "SPHEROID_WGS_1984"
                    }
                },
                "unit": "DEGREE",
                "spatialRefType": "SPATIALREF_EARTH_LONGITUDE_LATITUDE",
                "name": "GCS_WGS_1984",
                "type": "GCS_WGS_1984",
                "primeMeridian": {
                    "longitudeValue": 0,
                    "name": "Greenwich",
                    "type": "PRIMEMERIDIAN_GREENWICH"
                }
            }
        },
        "datasourceConnectionInfo": null
    }
}

const chartResult = {
    "features": {
        "type": "FeatureCollection",
        "features": [
            {
                "type": "Feature",
                "properties": {
                    "SMID": "1",
                    "SMSDRIW": "116.38831",
                    "SMSDRIN": "40.980675",
                    "SMSDRIE": "116.60729",
                    "SMSDRIS": "40.803284",
                    "SMUSERID": "4",
                    "SMAREA": "1.3188454380984211E8",
                    "SMPERIMETER": "79616.58012922351",
                    "SMGEOMETRYSIZE": "588",
                    "LANDTYPE": "用材林",
                    "AREA": "132.0",
                    "AREA_1": "132",
                    "stringID": null,
                    "ID": 1
                },
                "geometry": {
                    "type": "MultiPolygon",
                    "coordinates": [
                        [
                            [
                                [
                                    116.452409755349,
                                    40.92656164358
                                ],
                                [
                                    116.483357386004,
                                    40.9069469918439
                                ],

                                [
                                    116.442423257771,
                                    40.9417511118507
                                ],
                                [
                                    116.452409755349,
                                    40.92656164358
                                ]
                            ]
                        ],
                        [
                            [
                                [
                                    116.560117987415,
                                    40.9749988417875
                                ],

                                [
                                    116.547892153981,
                                    40.9705907375336
                                ],
                                [
                                    116.552270926448,
                                    40.980672910927
                                ],
                                [
                                    116.560117987415,
                                    40.9749988417875
                                ]
                            ]
                        ]
                    ]
                },
                "id": 1
            },
            {
                "type": "Feature",
                "properties": {
                    "SMID": "2",
                    "SMSDRIW": "116.60084",
                    "SMSDRIN": "41.040543",
                    "SMSDRIE": "116.72102",
                    "SMSDRIS": "40.853382",
                    "SMUSERID": "4",
                    "SMAREA": "9.680888002534656E7",
                    "SMPERIMETER": "50298.305148811625",
                    "SMGEOMETRYSIZE": "360",
                    "LANDTYPE": "用材林",
                    "AREA": "97.0",
                    "AREA_1": "97",
                    "stringID": null,
                    "ID": 2
                },
                "geometry": {
                    "type": "MultiPolygon",
                    "coordinates": [
                        [
                            [
                                [
                                    116.656010024549,
                                    41.036635850958
                                ],

                                [
                                    116.656010024549,
                                    41.036635850958
                                ]
                            ]
                        ]
                    ]
                },
                "id": 2
            },


            {
                "type": "Feature",
                "properties": {
                    "SMID": "101",
                    "SMSDRIW": "117.33055",
                    "SMSDRIN": "38.620922",
                    "SMSDRIE": "117.53431",
                    "SMSDRIS": "38.56734",
                    "SMUSERID": "9",
                    "SMAREA": "4.042988389975608E7",
                    "SMPERIMETER": "39763.54581827346",
                    "SMGEOMETRYSIZE": "264",
                    "LANDTYPE": "水浇地",
                    "AREA": "40.0",
                    "AREA_1": "40",
                    "stringID": null,
                    "ID": 101
                },
                "geometry": {
                    "type": "MultiPolygon",
                    "coordinates": [
                        [
                            [
                                [
                                    117.525891381017,
                                    38.6144829360722
                                ],

                                [
                                    117.525891381017,
                                    38.6144829360722
                                ]
                            ]
                        ]
                    ]
                },
                "id": 101
            }
        ]
    },
    "featureUriList": [],
    "totalCount": 3,
    "featureCount": 3,
    "succeed": true
};

// const datas_chart = {
//     "dataMetaInfo": {
//         "firstRowIsHead": false,
//         "previewURL": null,
//         "fileEncoding": "UTF-8",
//         "proxiedServiceType": null,
//         "hasScene": false,
//         "xIndex": null,
//         "yField": null,
//         "yIndex": null,
//         "separator": null,
//         "url": null,
//         "baseLayerType": null,
//         "xField": null,
//         "epsgCode": 0,
//         "realspaceType": null,
//         "releaseTimeMilli": 0,
//         "fieldTypes": null,
//         "bounds": null,
//         "proxiedServiceUrl": null,
//         "providers": null
//     },
//     "lastModfiedTime": 1525947856586,
//     "fileName": "671个气象站观测数据(5).xlsx",
//     "thumbnail": "http://support.supermap.com.cn:8092/services/../web/static/portal/img/map/cloud.png",
//     "dataItemServices": [],
//     "dataCheckResult": {
//         "serviceCheckInfos": [],
//         "dataCheckInfo": null
//     },
//     "publishInfo": null,
//     "authorizeSetting": [
//         {
//             "aliasName": "supermap",
//             "entityRoles": null,
//             "entityType": "USER",
//             "entityName": "supermap",
//             "dataPermissionType": "DELETE",
//             "entityId": null
//         },
//         {
//             "aliasName": "GUEST",
//             "entityRoles": null,
//             "entityType": "USER",
//             "entityName": "GUEST",
//             "dataPermissionType": "DOWNLOAD",
//             "entityId": null
//         }
//     ],
//     "description": null,
//     "userName": "supermap",
//     "type": "EXCEL",
//     "tags": [],
//     "coordType": null,
//     "size": 57719,
//     "createTime": 1525947856586,
//     "serviceStatus": "UNPUBLISHED",
//     "nickname": "supermap",
//     "id": 888186112,
//     "serviceId": null,
//     "downloadCount": 1,
//     "storageId": "hglvnuxh_emz1xllp_5d982d0d_29f0_4ade_96d3_ba8b8d127f74",
//     "status": "OK",
//     "MD5": "b77a03f565df9b17a5bfea85c7ce5d54"
// }

//原来的
// const iportal_content = {
//     "fileName": "671个气象站观测数据(5).xlsx",
//     "type": "EXCEL",
//     "lineNumber": 589,
//     "content": {
//         "colTitles": [
//             "区站号",
//             "站台",
//             "省份",
//             "X",
//             "Y",
//             "海拔",
//             "平均最低气温",
//             "最热七天气温",
//             "最高气温",
//             "最低气温",
//             "年均降雨"
//         ],
//         "rows": [
//             [
//                 "50136",
//                 "漠河",
//                 "黑龙江",
//                 "122.37",
//                 "53.47",
//                 "296",
//                 "-47",
//                 "29",
//                 "33",
//                 "-53",
//                 "366.1"
//             ],

//             [
//                 "59446",
//                 "灵山",
//                 "广西",
//                 "109.3",
//                 "22.42",
//                 "66",
//                 "2",
//                 "35",
//                 "37",
//                 "0",
//                 "1462.4"
//             ],
//             [
//                 "59453",
//                 "玉林",
//                 "广西",
//                 "110.17",
//                 "22.65",
//                 "81.8",
//                 "3",
//                 "35",
//                 "37",
//                 "1",
//                 "1637.4"
//             ]

//         ]
//     }
// }

const iportal_content =
{"fileName":"民航数据1(1).csv","type":"CSV","lineNumber":222,"content":{"colTitles":["latitude","longitude","altitude","geometry","机场","X坐标","Y坐标","名次","2017旅客吞吐量（人次）","2016旅客吞吐量（人次）","同比增速%","2017货邮吞吐量（吨）","2016货邮吞吐量（吨）","2017起降架次（架次）","2016起降架次（架次）"],"rows":[["40.07108","116.588918","","Point","北京/首都","116.588918","40.07108","1","95786296 ","94393454 ","-1.5","2029584 ","1943160 ","597259 ","606081 "],["31.093992","121.812361","","Point","上海/浦东","121.812361","31.093992","2","70001237 ","66002414 ","3.5","3824280 ","3440280 ","496774 ","479902 "],["23.190697","113.260931","","Point","广州/白云","113.260931","23.190697","3","65806977 ","59732147 ","6.9","1780423 ","1652215 ","465295 ","435231 "],["30.57779","103.9583","","Point","成都/双流","103.9583","30.57779","6","49801693 ","46039037 ","5.5","642872 ","611591 ","337055 ","319382 "],["22.543701","114.10978","","Point","深圳/宝安","114.10978","22.543701","5","45610651 ","41975090 ","6.8","1159019 ","1125985 ","340385 ","318582 "],["25.096153","102.928293","","Point","昆明/长水","102.928293","25.096153","4","44727691 ","41980339 ","7.5","418034 ","382854 ","350273 ","325934 "],["31.17323","121.355241","","Point","上海/虹桥","121.355241","31.17323","10","41884059 ","40460135 ","0.6","407461 ","428908 ","263586 ","261981 "],["34.257972","108.910298","","Point","西安/咸阳","108.910298","34.257972","7","41857229 ","36994506 ","9.6","259873 ","233779 ","318959 ","291027 "],["29.70721","106.63757","","Point","重庆/江北","106.63757","29.70721","8","38715210 ","35888819 ","4.3","366278 ","361091 ","288598 ","276807 "],["30.22899","120.42691","","Point","杭州/萧山","120.42691","30.22899","9","35570411 ","31594959 ","8","589462 ","487984 ","271066 ","251048 "],["31.731089","118.873171","","Point","南京/禄口","118.873171","31.731089","11","25822936 ","22357998 ","11.4","374215 ","341267 ","209394 ","187968 "],["24.534586","118.131845","","Point","厦门/高崎","118.131845","24.534586","13","24485239 ","22737610 ","1.6","338656 ","328420 ","186454 ","183546 "],["34.532784","113.834547","","Point","郑州/新郑","113.834547","34.532784","12","24299073 ","20763217 ","9.9","502715 ","456709 ","195717 ","178054 "],["28.19447","113.21622","","Point","长沙/黄花","113.21622","28.19447","17","23764820 ","21296675 ","6.9","138738 ","130276 ","179575 ","167910 "],["36.26619","120.38719","","Point","青岛/流亭","120.38719","36.26619","16","23210530 ","20505038 ","6.6","232064 ","230748 ","179592 ","168537 "],["30.77615","114.21736","","Point","武汉/天河","114.21736","30.77615","15","23129400 ","20771564 ","4.7","185017 ","175295 ","183883 ","175669 "],["19.93855","110.46215","","Point","海口/美兰","110.46215","19.93855","21","22584815 ","18803848 ","16.2","154496 ","148814 ","157535 ","135523 "],["43.902395","87.474494","","Point","乌鲁木齐/地窝堡","87.474494 ","43.902395","20","\"21","500","901\"","20200767 ","3 ","\"156","741.50\""],["39.119612","117.337137","","Point","天津/滨海","117.337137","39.119612","18","21005001 ","16871889 ","17.9","268284 ","237085 ","169585 ","143822 "],["18.30997","109.40844","","Point","三亚/凤凰","109.40844","18.30997","26","19389936 ","17369550 ","6.1","89116 ","86847 ","121558 ","114581 "],["45.21552","128.27117","","Point","哈尔滨/太平","128.27117","45.21552","24","18810317 ","16267130 ","11.9","121176 ","124795 ","136803 ","122282 "],["27.30739","106.84504","","Point","贵阳/龙洞堡","106.845040 ","27.30739","22","\"18","109","610\"","15105225 ","16 ","\"102","369.70\""],["38.96211","121.546","","Point","大连/周水子","121.546000 ","38.96211","23","\"17","503","810\"","15258209 ","11 ","\"164","777.60\""],["41.639033","123.499642","","Point","沈阳/桃仙","123.499642","41.639033","25","17342626 ","14967228 ","10.6","159117 ","155769 ","127387 ","115164 "],["36.806159","117.234409","","Point","济南/遥墙","117.234409","36.806159","27","14319264 ","11616914 ","15.4","95152 ","100013 ","115529 ","100152 "],["22.60967","108.17172","","Point","南宁/吴圩","108.17172","22.60967","28","13915542 ","11559860 ","14.9","110444 ","104618 ","108049 ","94065 "],["36.33734","104.01974","","Point","兰州/中川","104.01974","36.33734","29","12816443 ","10897025 ","13.8","60906 ","59455 ","103690 ","91091 "],["25.928549","119.672848","","Point","福州/长乐","119.672848","25.928549","31","12469235 ","11606446 ","1.3","125603 ","121658 ","98908 ","97606 "],["37.76528","112.63385","","Point","太原/武宿","112.63385","37.76528","30","12401086 ","9847840 ","22.3","48428 ","49104 ","101076 ","82641 "],["43.98809","125.6899","","Point","长春/龙嘉","125.6899","43.98809","36","11662943 ","9493351 ","17.3","88907 ","86554 ","86041 ","73371 "],["28.85173","115.91209","","Point","南昌/昌北","115.91209","28.85173","34","10937105 ","7863635 ","35.3","52262 ","50608 ","89863 ","66409 "],["40.85965","111.82604","","Point","呼和浩特/白塔","111.82604","40.85965","33","10348617 ","8185210 ","18.3","39611 ","37446 ","96872 ","81873 "],["38.275134","114.69645","","Point","石家庄/正定","114.69645","38.275134","38","9582921 ","7214590 ","17.2","41013 ","43765 ","80492 ","68687 "],["29.81771","121.46942","","Point","宁波/栎社","121.46942","29.81771","43","9390527 ","7792305 ","15.1","120447 ","107020 ","73257 ","63663 "],["27.963421","120.799747","","Point","温州/龙湾","120.799747","27.963421","42","9285621 ","8189717 ","9.7","75532 ","77748 ","74505 ","67916 "],["22.005756","113.381945","","Point","珠海/金湾","113.381945","22.005756","41","9216808 ","6130384 ","21.7","37379 ","31512 ","74694 ","61400 "],["31.975854","117.106396","","Point","合肥/新桥","117.106396","31.975854","40","9147128 ","7391998 ","19.6","63575 ","58097 ","76263 ","63750 "],["38.49154","106.49616","","Point","银川/河东","106.49616","38.49154","45","7936445 ","6341479 ","24.4","42182 ","37107 ","67059 ","53921 "],["25.21118","110.048655","","Point","桂林/两江","110.048655","25.21118","46","7862015 ","6630251 ","12","24188 ","26414 ","64260 ","57387 "],["26.668174","100.253903","","Point","丽江/三义","100.253903","26.668174","50","7105345 ","6784474 ","2","10266 ","9299 ","54250 ","53170 "],["31.503019","120.433096","","Point","无锡/硕放","120.433096","31.503019","52","6683380 ","5561927 ","15.7","107598 ","95984 ","52839 ","45679 "],["37.80597","120.814481","","Point","烟台/蓬莱","120.814481","37.80597","47","6503015 ","5135200 ","21.9","41141 ","43055 ","62105 ","50962 "],["39.792954","116.403072","","Point","北京/南苑","116.403072","39.792954","63","5953883 ","5586388 ","4.6","23205 ","26635 ","41340 ","39507 "],["36.611871","101.80351","","Point","西宁/曹家堡","101.803510 ","36.611871","54","\"5","627","696\"","4681138 ","19 ","\"27","687.20\""],["24.80061","118.59263","","Point","泉州/晋江","118.59263","24.80061","59","5340586 ","3793150 ","30","59278 ","49683 ","43926 ","33787 "],["23.542089","116.511136","","Point","揭阳/潮汕","116.511136","23.542089","53","4851015 ","3818152 ","15.1","26271 ","25243 ","49109 ","42684 "],["22.004287","100.796473","","Point","西双版纳/嘎洒","100.796473","22.004287","69","3990867 ","4335339 ","-8.9","13061 ","10904 ","31925 ","35034 "],["29.651553","91.01721","","Point","拉萨/贡嘎","91.01721","29.651553","67","3718350 ","3339429 ","4.9","32365 ","27687 ","32561 ","31054 "],["31.428986","104.743592","","Point","绵阳/南郊","104.743592","31.428986","19","3543403 ","2172922 ","-11","7225 ","6465 ","169088 ","190062 "],["31.91103","119.78689","","Point","常州/奔牛","119.78689","31.91103","64","2510512 ","1955844 ","55","18871 ","15690 ","40498 ","26121 "],["30.552671","111.484952","","Point","宜昌/三峡","111.484952","30.552671","39","2243812 ","1535707 ","85.5","4206 ","3807 ","76974 ","41504 "],["49.212421","119.82459","","Point","呼伦贝尔/东山","119.82459","49.212421","82","2169197 ","1878901 ","12.3","5000 ","7265 ","18464 ","16443 "],["39.49626","109.87125","","Point","鄂尔多斯/伊金霍洛","109.87125","39.49626","56","2105842 ","1706356 ","3","11816 ","9115 ","45483 ","44162 "],["21.212952","110.363507","","Point","湛江","110.363507","21.212952","74","2090568 ","1503904 ","34.4","5239 ","4239 ","25487 ","18970 "],["40.56451","110.00402","","Point","包头/二里半","110.004020 ","40.56451","77","\"2","089","009\"","1867690 ","18 ","\"8","981.50\""],["39.53719","76.01373","","Point","喀什","76.01373","39.53719","70","2048004 ","1815091 ","57.1","7719 ","6554 ","30679 ","19524 "],["37.194545","122.263127","","Point","威海/大水泊","122.263127 ","37.194545","84","\"2","037","485\"","1735309 ","17 ","\"5","729.00\""],["32.07085","120.98063","","Point","南通/兴东","120.98063","32.07085","72","2009038 ","1538158 ","34.5","39447 ","35371 ","28623 ","21281 "],["34.266663","117.1996","","Point","徐州/观音","117.1996","34.266663","65","1916517 ","1487086 ","24","9233 ","9088 ","36537 ","29470 "],["32.56075","119.718259","","Point","扬州/泰州","119.718259","32.56075","49","1836515 ","1434193 ","45.8","9378 ","8226 ","55503 ","38080 "],["29.104701","110.44981","","Point","张家界/荷花","110.44981","29.104701","85","1773700 ","1701712 ","2.1","1426 ","1014 ","17289 ","16939 "],["38.277279","109.56905","","Point","榆林/榆阳","109.56905","38.277279","83","1771190 ","1513793 ","17.9","4179 ","3709 ","18327 ","15551 "],["21.541408","109.190414","","Point","北海/福成","109.190414","21.541408","88","1711199 ","1234031 ","11.9","5511 ","4655 ","16635 ","14868 "],["24.383558","98.480307","","Point","德宏/芒市","98.480307","24.383558","94","1652533 ","1537536 ","9.9","8511 ","6858 ","13982 ","12726 "],["25.621485","100.282959","","Point","大理","100.282959","25.621485","92","1581271 ","1431116 ","15","5908 ","4123 ","15105 ","13130 "],["27.807408","107.250766","","Point","遵义/新舟","107.250766","27.807408","91","1561066 ","1135432 ","29.1","1618 ","977 ","15310 ","11856 "],["35.11417","111.04361","","Point","运城/张孝","111.04361","35.11417","68","1444590 ","843226 ","94","3173 ","3200 ","32265 ","16634 "],["42.88794","129.44718","","Point","延吉/朝阳川","129.447180 ","42.88794","101","\"1","411","859\"","1481159 ","(10)","\"6","354.60\""],["27.88192","109.31041","","Point","铜仁/凤凰","109.31041","27.88192","80","1344928 ","577645 ","72.9","132 ","55 ","19126 ","11060 "],["35.048242","118.413285","","Point","临沂/沐埠岭","118.413285 ","35.048242","99","\"1","328","071\"","1203387 ","2 ","\"6","128.70\""],["33.428319","120.209716","","Point","盐城/南洋","120.209716","33.428319","98","1302974 ","1209004 ","5.8","5540 ","5118 ","13121 ","12402 "],["29.343513","120.035402","","Point","义乌","120.035402","29.343513","104","1294895 ","1226697 ","-2.9","6871 ","5914 ","10974 ","11302 "],["33.788792","119.131102","","Point","淮安/涟水","119.131102","33.788792","90","1286369 ","861533 ","-33.7","5007 ","4638 ","15385 ","23215 "],["41.62275","86.14375","","Point","库尔勒","86.143750 ","41.62275","100","\"1","279","829\"","1147634 ","11 ","\"7","314.10\""],["25.807514","114.746455","","Point","赣州/黄金","114.746455","25.807514","87","1279798 ","1083240 ","9.9","6629 ","7307 ","16787 ","15269 "],["41.234539","80.31237","","Point","阿克苏/温宿","80.31237","41.234539","105","1276512 ","1103589 ","7.5","6109 ","5171 ","10805 ","10052 "],["42.15647","118.83922","","Point","赤峰/玉龙","118.83922","42.15647","96","1209514 ","1042682 ","6.4","1841 ","1640 ","13563 ","12748 "],["43.957408","81.333375","","Point","伊宁","81.333375","43.957408","108","1151337 ","1041470 ","8.2","4568 ","3904 ","10462 ","9673 "],["24.206411","109.39851","","Point","柳州/白莲","109.39851","24.206411","102","1136021 ","1036219 ","-0.6","5906 ","5410 ","11323 ","11393 "],["27.30215","105.28408","","Point","毕节/飞雄","105.28408","27.30215","95","1110613 ","733605 ","31.1","1046 ","433 ","13708 ","10455 "],["34.57062","118.881624","","Point","连云港/白塔埠","118.881624 ","34.57062","103","\"1","092","924\"","850972 ","21 ","\"1","663.10\""],["37.03968","79.8741","","Point","和田","79.8741","37.03968","115","1030691 ","935314 ","11.9","2262 ","1585 ","8635 ","7714 "],["32.14942","112.29509","","Point","襄阳/刘集","112.29509","32.14942","35","1027010 ","824160 ","7.2","2915 ","2511 ","89270 ","83261 "],["29.932913","122.359352","","Point","舟山/普陀山","122.359352 ","29.932913","76","\"1","023","039\"","800877 ","5 ","196.8","319 "],["39.653049","113.445496","","Point","腾冲/驼峰","113.445496","39.653049","113","997372 ","805638 ","26","2389 ","1444 ","9001 ","7144 "],["35.29364","116.353255","","Point","济宁/曲阜","116.353255","35.29364","118","970860 ","623948 ","40.2","2247 ","1814 ","8122 ","5794 "],["23.046479","114.604937","","Point","惠州/平潭","114.604937","23.046479","114","956858 ","545560 ","65.7","3986 ","3723 ","8670 ","5232 "],["43.5579","122.20957","","Point","通辽","122.20957","43.5579","66","924759 ","710474 ","193.2","1693 ","1472 ","34733 ","11846 "],["25.08118","104.95934","","Point","兴义","104.95934","25.08118","107","922070 ","519653 ","36.5","891 ","243 ","10653 ","7802 "],["34.739214","112.393628","","Point","洛阳/北郊","112.393628","34.739214","14","880253 ","915971 ","4.6","1464 ","1486 ","184810 ","176630 "],["32.586011","110.910913","","Point","十堰/武当山","110.910913 ","32.586011","109","\"869","780\"","388923 ","110 ","","","9905 "],["28.797781","104.550293","","Point","宜宾/菜坝","104.550293","28.797781","117","827867 ","762935 ","3.5","2491 ","2920 ","8201 ","7925 "],["28.55513","121.42171","","Point","台州/路桥","121.42171","28.55513","123","821965 ","691442 ","14.1","6842 ","6720 ","6454 ","5658 "],["44.525407","129.630117","","Point","牡丹江/海浪","129.630117","44.525407","131","784991 ","694286 ","10.6","987 ","1162 ","6122 ","5534 "],["32.98143","112.61982","","Point","南阳/姜营","112.61982","32.98143","48","781563 ","612572 ","19.3","962 ","797 ","57600 ","48272 "],["30.319323","109.489899","","Point","恩施/许家坪","109.489899 ","30.319323","78","\"770","053\"","496148 ","395 ","\"1","202.00\"","989 "],["30.793442","106.168002","","Point","南充/高坪","106.168002","30.793442","55","752668 ","597489 ","158.4","2914 ","3107 ","47904 ","18542 "],["35.402531","119.331616","","Point","日照/山字河","119.331616 ","35.402531","60","\"737","741\"","408507 ","158 ","\"1","026.80\"","457 "],["29.72993","118.260793","","Point","黄山/屯溪","118.260793","29.72993","119","725948 ","604911 ","22.6","2291 ","2067 ","8063 ","6575 "],["36.52425","114.43457","","Point","邯郸","114.43457","36.52425","57","684081 ","462657 ","82.6","703 ","516 ","45328 ","24824 "],["46.821878","130.397278","","Point","佳木斯/东郊","130.397278","46.821878","127","667788 ","455337 ","49.5","1076 ","1081 ","6233 ","4170 "],["30.79449","108.43033","","Point","万州/五桥","108.43033","30.79449","75","656189 ","550727 ","30.7","2502 ","2247 ","22786 ","17438 "],["43.91837","115.96577","","Point","锡林浩特","115.96577","43.91837","81","648455 ","582194 ","-10.8","1526 ","2016 ","18756 ","21016 "],["40.057892","113.486772","","Point","大同/云冈","113.486772","40.057892","73","640095 ","544530 ","44.5","1704 ","1655 ","27666 ","19147 "],["27.97648","102.19101","","Point","西昌/青山","102.19101","27.97648","129","634794 ","469089 ","28.7","1428 ","1242 ","6166 ","4790 "],["42.149956","127.574848","","Point","白山/长白山","127.574848 ","42.149956","120","\"626","884\"","537709 ","14 ","118.5","176 ","7453 "],["26.853318","114.742637","","Point","井冈山","114.742637 ","26.853318","126","\"626","775\"","540865 ","7 ","\"2","219.60\"","3011 "],["29.348585","117.215386","","Point","景德镇/罗家","117.215386","29.348585","150","621880 ","543371 ","9.1","2120 ","1811 ","4638 ","4252 "],["46.719014","125.114334","","Point","大庆/萨尔图","125.114334 ","46.719014","140","\"621","053\"","489354 ","20 ","\"1","399.50\"","1347 "],["32.87722","115.743909","","Point","阜阳","115.743909","32.87722","86","610099 ","450308 ","98.2","533 ","547 ","16969 ","8560 "],["25.051671","99.165713","","Point","保山/云瑞","99.165713","25.051671","133","601307 ","410557 ","52.3","1128 ","835 ","6032 ","3960 "],["40.740649","114.938624","","Point","张家口/宁远","114.938624","40.740649","128","600658 ","351950 ","61.5","123 ","97 ","6173 ","3822 "],["36.646822","119.122362","","Point","潍坊","119.122362","36.646822","125","597763 ","540828 ","-2.2","26469 ","22186 ","6358 ","6499 "],["22.778142","100.973443","","Point","普洱/思茅","100.973443","22.778142","121","581680 ","487808 ","25.3","1079 ","814 ","7156 ","5713 "],["32.64239","117.02933","","Point","迪庆/香格里拉","117.02933","32.64239","124","570974 ","486640 ","25.3","957 ","874 ","6404 ","5112 "],["36.19175","113.08381","","Point","长治/王村","113.08381","36.19175","122","557142 ","741573 ","-27.3","465 ","719 ","6674 ","9175 "],["27.815915","114.401596","","Point","宜春/明月山","114.401596 ","27.815915","130","\"542","727\"","469976 ","21 ","370","275 ","6153 "],["37.506096","118.792213","","Point","东营/胜利","118.792213","37.506096","58","531381 ","377826 ","4.8","329 ","298 ","44240 ","42217 "],["40.136442","94.683541","","Point","敦煌","94.683541","40.136442","138","526779 ","496459 ","-5.7","510 ","518 ","5509 ","5839 "],["32.851353","103.685263","","Point","九寨/黄龙","103.685263","32.851353","148","523130 ","1122223 ","-51.8","196 ","138 ","4888 ","10139 "],["39.724471","117.999197","","Point","唐山/三女河","117.999197 ","39.724471","143","\"519","164\"","240999 ","81 ","\"1","261.00\"","837 "],["49.572574","117.339572","","Point","满洲里/西郊","117.339572","49.572574","136","501682 ","454371 ","5.2","1011 ","1665 ","5672 ","5390 "],["27.724193","118.010691","","Point","武夷山","118.010691 ","27.724193","135","\"493","460\"","455688 ","(0)","826.9","868 ","5832 "],["30.73817","117.690927","","Point","池州/九华山","117.690927 ","30.73817","141","\"475","132\"","355956 ","27 ","408.3","364 ","5430 "],["23.080913","113.075983","","Point","佛山/沙堤","113.075983","23.080913","163","471472 ","355904 ","21.4","243 ","445 ","3381 ","2784 "],["26.718615","112.621995","","Point","衡阳/南岳","112.621995","26.718615","146","470519 ","311549 ","36.2","602 ","882 ","4962 ","3644 "],["29.497729","94.580436","","Point","林芝/米林","94.580436","29.497729","144","467879 ","389530 ","23.7","1943 ","1654 ","5256 ","4248 "],["30.580776","117.055412","","Point","安庆","117.055412","30.580776","147","459170 ","325634 ","25.9","1434 ","1418 ","4904 ","3894 "],["39.79159","106.80817","","Point","乌海","106.80817","39.79159","132","454296 ","339824 ","49.5","599 ","988 ","6083 ","4069 "],["28.916307","111.643672","","Point","常德/桃花源","111.643672 ","28.916307","37","\"438","362\"","413484 ","(6)","368.7","258 ","83847 "],["39.815459","98.340651","","Point","嘉峪关","98.340651 ","39.815459","151","\"434","483\"","399401 ","(5)","\"1","616.10\"","1704 "],["26.971508","107.989467","","Point","凯里/黄平","107.989467","26.971508","112","425155 ","94137 ","61.7","1 ","","9476 ","5862 "],["31.128664","107.434035","","Point","达州/河市","107.434035","31.128664","149","424496 ","402691 ","4.1","1464 ","1475 ","4752 ","4563 "],["26.25399","105.87646","","Point","安顺/黄果树105.876460 ","26.25399","137","\"421","517\"","250798 ","24 ","897.2","958 ","5652 ","4545 "],["33.150225","107.334352","","Point","汉中/城固","107.334352","33.150225","106","414361 ","195178 ","403.2","631 ","402 ","10753 ","2137 "],["47.25401","123.92377","","Point","齐齐哈尔/三家子","123.923770 ","47.25401","159","\"403","008\"","322120 ","20 ","582.3","833 ","3556 "],["23.897171","100.086549","","Point","临沧","100.086549","23.897171","154","399406 ","353467 ","22.4","751 ","670 ","3918 ","3200 "],["26.362772","115.371323","","Point","梅县/长岗岌","115.371323 ","26.362772","142","\"397","857\"","335974 ","6 ","126.9","194 ","5414 "],["28.84208","105.38312","","Point","泸州/蓝田","105.38312","28.84208","153","395575 ","985108 ","-60","1062 ","3293 ","3996 ","9992 "],["45.4683","84.95947","","Point","克拉玛依","84.95947","45.4683","61","389677 ","272585 ","3.6","281 ","211 ","43089 ","41598 "],["26.605323","104.980987","","Point","六盘水/月照","104.980987","26.605323","139","385141 ","227958 ","40.7","48 ","51 ","5484 ","3898 "],["35.80088","107.61048","","Point","庆阳","107.61048","35.80088","93","337346 ","324790 ","-23.3","49 ","38 ","14749 ","19234 "],["36.63886","109.55704","","Point","延安/二十里堡","109.55704","36.63886","167","333724 ","236909 ","36.4","346 ","217 ","3119 ","2287 "],["39.85273","119.47154","","Point","秦皇岛/北戴河","119.471540 ","39.85273","110","\"328","473\"","231240 ","176 ","506.2","426 ","9699 "],["41.033569","113.135849","","Point","乌兰察布/集宁","113.135849","41.033569","145","324128 ","66507 ","329.8","3 ","","5171 ","1203 "],["19.155447","110.557769","","Point","琼海/博鳌","110.557769","19.155447","116","316246 ","10696 ","622.9","52 ","2 ","8523 ","1179 "],["42.8184","93.76535","","Point","哈密","93.76535","42.8184","158","299625 ","163528 ","66.4","483 ","410 ","3693 ","2220 "],["41.68274","82.87683","","Point","库车/龟兹","82.87683","41.68274","157","295001 ","273695 ","17.8","380 ","293 ","3745 ","3178 "],["29.5145","108.834","","Point","黔江/武陵山","108.834000 ","29.5145","165","\"288","749\"","153443 ","59 ","120.5","78 ","3320 "],["40.8859","107.701086","","Point","巴彦淖尔/天吉泰","107.701086 ","40.8859","152","\"282","874\"","273136 ","(2)","595.6","891 ","3997 "],["27.3244","103.75462","","Point","昭通","103.754620 ","27.3244","160","\"280","639\"","224051 ","17 ","249.4","84 ","3470 "],["37.528343","111.173422","","Point","吕梁/大武","111.173422","37.528343","162","275786 ","213797 ","17.2","43 ","21 ","3406 ","2906 "],["26.534456","101.799265","","Point","攀枝花/保安营","101.799265 ","26.534456","172","\"272","926\"","228508 ","15 ","\"1","345.70\"","1154 "],["32.39271","105.70477","","Point","广元/盘龙","105.70477","32.39271","89","265256 ","236664 ","518.9","320 ","293 ","15397 ","2488 "],["32.839047","97.033822","","Point","玉树/巴塘","97.033822","32.839047","169","263706 ","181215 ","48.6","722 ","387 ","3106 ","2090 "],["38.413956","112.729334","","Point","忻州/五台山","112.729334 ","38.413956","155","\"261","146\"","111585 ","115 ","25.8","11 ","3864 "],["36.099706","111.616682","","Point","临汾/乔李","111.616682","36.099706","168","254290 ","151093 ","43.3","780 ","175 ","3116 ","2174 "],["41.089196","121.153656","","Point","锦州/锦州湾","121.153656 ","41.089196","183","\"232","715\"","158154 ","33 ","911.8","829 ","2110 "],["30.551642","97.114994","","Point","昌都/邦达","97.114994","30.551642","178","231235 ","225666 ","2.2","714 ","976 ","2252 ","2204 "],["45.299703","131.208834","","Point","鸡西/兴凯湖","131.208834 ","45.299703","174","\"222","125\"","190754 ","32 ","257","313 ","2752 "],["40.630024","122.424715","","Point","营口/兰旗","122.424715","40.630024","177","205528 ","115468 ","62.3","188 ","26 ","2459 ","1515 "],["28.96474","118.88025","","Point","衢州","118.88025","28.96474","192","202620 ","208219 ","-2.4","602 ","639 ","1652 ","1692 "],["41.095239","122.879127","","Point","鞍山/腾鳌","122.879127","41.095239","181","199279 ","152647 ","17.8","16 ","17 ","2234 ","1896 "],["29.307956","100.068154","","Point","稻城/亚丁","100.068154","29.307956","187","198952 ","186350 ","-2.5","268 ","206 ","1930 ","1980 "],["40.03342","124.28688","","Point","丹东/浪头","124.28688","40.03342","188","198498 ","211516 ","-16.6","1218 ","1623 ","1901 ","2280 "],["26.400633","117.792475","","Point","三明/沙县","117.792475","26.400633","184","198272 ","69734 ","36.8","374 ","81 ","2095 ","1531 "],["27.44155","109.70564","","Point","怀化/芷江","109.70564","27.44155","161","180497 ","115518 ","75.5","2 ","10 ","3416 ","1946 "],["34.555065","105.868786","","Point","天水/麦积山","105.868786 ","34.555065","164","\"178","227\"","109207 ","38 ","52.3","38 ","3340 "],["36.437993","94.772246","","Point","格尔木","94.772246 ","36.437993","180","\"172","266\"","149056 ","13 ","861.9","678 ","2238 "],["37.57652","105.14125","","Point","中卫/香山","105.14125","37.57652","62","159744 ","102834 ","5.7","127 ","90 ","42321 ","40046 "],["36.014478","106.285358","","Point","固原/六盘山","106.285358 ","36.014478","97","\"157","183\"","107358 ","63 ","15.1","8 ","13241 "],["28.727072","100.571465","","Point","阿尔山/伊尔施","100.571465 ","28.727072","173","\"155","187\"","105043 ","60 ","384.3","443 ","2758 "],["38.495919","102.332214","","Point","金昌/金川","102.332214","38.495919","185","152606 ","114797 ","-40.7","103 ","139 ","2075 ","3502 "],["50.17957","127.3203","","Point","黑河","127.3203","50.17957","175","150692 ","140752 ","0.5","72 ","65 ","2698 ","2684 "],["43.031421","89.102427","","Point","吐鲁番/交河","89.102427","43.031421","176","147653 ","55373 ","94.3","1157 ","101 ","2642 ","1360 "],["50.37518","124.11834","","Point","加格达奇","124.11834","50.37518","170","147417 ","132221 ","7.4","50 ","37 ","2977 ","2772 "],["41.127874","118.080298","","Point","承德/普宁","118.080298","41.127874","199","146979 ","","","3 ","","1352 ","undefined"],["28.419874","117.899436","","Point","上饶/三清山","117.899436 ","28.419874","193","\"146","655\"","","","6.6","","1634 "],["25.690503","116.76488","","Point","连城/冠豸山","116.764880 ","25.690503","194","\"142","794\"","115931 ","(0)","224.5","96 ","1604 "],["38.901196","100.603731","","Point","张掖/甘州","100.603731","38.901196","196","138292 ","117637 ","51.8","137 ","90 ","1576 ","1576 "],["41.510985","120.441863","","Point","朝阳","120.441863","41.510985","44","136221 ","132273 ","-15.6","15 ","85 ","70461 ","83469 "],["47.731753","128.893249","","Point","伊春/林都","128.893249","47.731753","198","135326 ","122081 ","10.5","53 ","44 ","1407 ","1273 "],["44.898276","82.303703","","Point","博乐/阿拉山口","82.303703","44.898276","51","134269 ","129030 ","2.5","113 ","55 ","52964 ","51666 "],["38.746409","105.644472","","Point","阿拉善左旗/巴彦浩特","105.644472","38.746409","134","121884 ","56690 ","109.2","0 ","","5997 ","2866 "],["48.22439","87.00544","","Point","布尔津/喀纳斯","87.00544","48.22439","166","121284 ","99574 ","182.9","4 ","3 ","3126 ","1105 "],["26.3413","111.6179","","Point","永州/零陵","111.6179","26.3413","195","120824 ","112039 ","-1.4","15 ","49 ","1594 ","1616 "],["34.813611","102.68478","","Point","甘南/夏河","102.68478","34.813611","189","118282 ","91556 ","31.3","304 ","249 ","1888 ","1438 "],["30.140162","101.741137","","Point","甘孜/康定","101.741137","30.140162","191","116324 ","133669 ","-2.6","48 ","13 ","1782 ","1830 "],["23.735025","106.907509","","Point","百色/巴马","106.907509","23.735025","197","109918 ","99489 ","-0.8","6 ","","1522 ","1534 "],["23.603423","104.346325","","Point","文山/普者黑","104.346325","23.603423","111","108571 ","91699 ","751","291 ","254 ","9582 ","1126 "],["47.75357","88.09164","","Point","阿勒泰","88.091640 ","47.75357","171","\"105","301\"","298486 ","(40)","87.8","184 ","2917 "],["42.056477","125.762534","","Point","通化/三源浦","125.762534 ","42.056477","202","\"104","234\"","74831 ","(5)","","0 ","1106 "],["27.800021","107.253395","","Point","遵义/茅台","107.253395","27.800021","201","101563 ","","","","","1188 ","undefined"],["25.44036","107.96531","","Point","黔南州/荔波","107.96531","25.44036","186","101462 ","46242 ","64","1 ","1 ","1984 ","1210 "],["26.31713","109.15841","","Point","黎平","109.15841","26.31713","179","93382 ","47358 ","71.8","12 ","1 ","2250 ","1310 "],["43.4305","83.3795","","Point","那拉提","83.379500 ","43.4305","203","\"84","491\"","92634 ","(7)","105.5","44 ","1092 "],["52.947719","122.345831","","Point","漠河/古莲","122.345831","52.947719","190","83801 ","72505 ","5.5","77 ","45 ","1872 ","1774 "],["26.797136","110.64856","","Point","邵阳/武冈","110.64856","26.797136","206","82232 ","","","2 ","","937 ","undefined"],["23.267237","99.365303","","Point","沧源/佤山","99.365303","23.267237","213","81945 ","2773 ","3272.7","24 ","","742 ","22 "],["37.133107","97.262543","","Point","海西/德令哈","97.262543 ","37.133107","208","\"81","661\"","62961 ","27 ","228.5","64 ","926 "],["44.305886","86.041075","","Point","石河子/花园","86.041075","44.305886","200","80949 ","38646 ","68.1","111 ","3 ","1210 ","720 "],["46.67072","83.34263","","Point","塔城","83.34263","46.67072","210","74724 ","138353 ","-50.1","18 ","22 ","858 ","1718 "],["30.132689","122.769531","","Point","抚远/东极","122.769531","30.132689","211","65148 ","62509 ","1.9","2 ","1 ","852 ","836 "],["29.352523","89.318596","","Point","日喀则","89.318596 ","29.352523","214","\"64","539\"","48132 ","22 ","311.4","257 ","739 "],["22.335874","99.589631","","Point","澜沧/景迈","99.589631","22.335874","218","61407 ","","","1 ","","584 ","undefined"],["47.747101","122.831184","","Point","扎兰屯/成吉思汗","122.831184","47.747101","205","56675 ","432 ","13150","0 ","","1060 ","8 "],["38.14462","85.53609","","Point","且末","85.53609","38.14462","215","50762 ","1464 ","4437.5","5 ","","726 ","16 "],["16.824674","112.33768","","Point","三沙/永兴","112.33768","16.824674","216","49810 ","759 ","4375","10 ","","716 ","16 "],["27.65296","100.80829","","Point","宁蒗/泸沽湖","100.808290 ","27.65296","219","\"47","439\"","40090 ","11 ","26","2 ","454 "],["43.629272","122.292213","","Point","霍林河","122.292213 ","43.629272","204","\"47","010\"","","","0.2","","1068 "],["36.894039","98.786598","","Point","富蕴/可可托海","98.786598","36.894039","182","41796 ","38805 ","222.3","37 ","8 ","2224 ","690 "],["38.200017","90.841982","","Point","海西/花土沟","90.841982 ","38.200017","220","\"38","935\"","24082 ","85 ","6.9","","451 "],["45.505303","123.023483","","Point","白城/长安","123.023483","45.505303","221","31439 ","","","0 ","","438 ","undefined"],["23.45351","111.25557","","Point","梧州/长州岛","111.255570 ","23.45351","32","\"27","475\"","70639 ","3 ","7.5","21 ","98260 "],["44.94196","124.559594","","Point","松原/查干湖","124.559594 ","44.94196","225","\"24","231\"","","","0.7","","386 "],["40.625729","107.056274","","Point","额济纳旗/桃来","107.056274","40.625729","209","23843 ","17264 ","55.1","0 ","0 ","881 ","568 "],["24.71394","107.842501","","Point","河池/金城江","107.842501 ","24.71394","223","\"14","083\"","30299 ","(37)","","","419 "],["32.529552","102.354863","","Point","阿坝/红原","102.354863","32.529552","227","12541 ","24713 ","-39.3","","","210 ","346 "],["47.106369","132.670313","","Point","建三江/湿地","132.670313","47.106369","228","11695 ","","","","","136 ","undefined"],["31.672834","110.429298","","Point","神农架/红坪","110.429298","31.672834","226","10299 ","18074 ","-7.5","","","322 ","348 "],["39.243991","122.668699","","Point","长海/大长山岛","122.668699","39.243991","224","2958 ","3392 ","-14.1","","","401 ","467 "],["32.70707","108.93981","","Point","安康","108.93981","32.70707","79","","","82.1","","","19485 ","10700 "]]}}

const localSearch = {"totalHits":1,"poiInfos":[{"uid":"1f062db5bf2e12b5b04c49e6","score":0,"address":null,"name":"北京市","telephone":null,"location":{"x":116.40699419088875,"y":39.90459558586809}}]}

const portal_data1 = 
{"shareSetting":{"scope":{"toUser":true,"toDepartment":true,"toGroup":true},"allowListUsers":false},"webPrintingConfig":{"webPrintingServiceAvaliable":true},"mapViewerSetting":{"displayCoords":false,"displayDataLayers":false,"maxFeatures":3000},"dataScienceSetting":{"address":null},"dataCapabilities":{"hasHostedServer":true,"hasRelationship":false,"binaryStorageValid":true},"registerSetting":{"allowUserAudit":true,"sendEmailNotification":false,"allowDataCenterRole":true,"extendUserFields":[],"defaultRole":"PORTAL_USER","reservedUserNames":[],"allowRegister":false},"keyConfig":{"defaultMaxCount":10000,"allowQuotaAudit":false,"defaultMaxCountType":"DAY","userDefaultMaxKeySum":null},"customDirectorySetting":{"allowCustomDirectory":"{\"DATA\":true,\"SERVICE\":true,\"MAP\":true,\"SCENE\":true,\"INSIGHTS\":false}"},"appsConfig":{"editableAppsLimitToAdmin":[],"ROOT_NAME":"appsConfig","newResourceDefaultPermission":[{"permissionType":"PUBLIC_VIEW","portalAppType":"DATAVIZ"}]},"version":"1.0.0","appCenterConfig":{"enableAudit":true,"auditAllAttributes":false,"auditedAttributes":[]},"portalCustomSetting":{"customType":null,"supportMultiLanguages":{"languages":null,"enable":false}},"loginSetting":{"captchaConfig":{"enable":false,"expire":120,"length":4},"authenticationDelegation":null},"departmentSetting":{"enable":true,"order":{"orderType":"ASC","orderField":"CREATETIME"}},"serviceProxy":{"httpConnPoolInfo":null,"enableAccessStatistics":true,"scheme":null,"enableBuiltinProxy":true,"port":8095,"proxyServerRootUrl":"https://iportal.supermap.io","rootUrlPostfix":"portalproxy","enable":true,"httpsSetting":null,"cacheConfig":null},"mapApps":{"mapApps":[{"name":"mapViewer_ol5"}]},"mapsSetting":{"allowMapAudit":true,"showBatchAddMaps":true,"auditedAttributes":"all"},"groupSetting":{"enable":true},"serviceAuditSetting":{"allowServiceAudit":true,"auditedAttributes":"all"},"clientSideKeycloakConfig":{"clientId":null,"baseUri":"http://{host}:{port}/auth","realm":"{realmName}","enabled":false}}

const portal_data = 
{"extent":{"leftBottom":{"x":-20037508.342789248,"y":-20037508.34278914},"rightTop":{"x":20037508.342789244,"y":20037508.342789087}},"maxScale":"1:144447.927","level":5,"center":{"x":11615300.701720804,"y":4436879.386230171},"baseLayer":{"layerType":"TILE","visible":true,"name":"ChinaDark","url":"https://iserver.supermap.io/iserver/services/map-china400/rest/maps/ChinaDark"},"layers":[{"layerType":"UNIQUE","visible":true,"themeSetting":{"themeField":"名次","customSettings":{"\"421":"#eff8a6","110":"#e8f69c","111":"#8bca99","112":"#f0f9a8","113":"#fee99a","114":"#feea9d","115":"#fee696","116":"#e7f59a","117":"#feefa4","118":"#feea9b","119":"#fef4ae","10":"#dc4c50","11":"#e05551","12":"#e25952","13":"#e15752","14":"#feeda1","15":"#e56053","16":"#e45e53","17":"#e35b52","18":"#e96654","19":"#fca769","120":"#fefab7","121":"#fcfebb","1":"#d53e4f","122":"#fbfdb9","2":"#d6404f","123":"#feefa5","3":"#d8444f","124":"#fcfdba","4":"#db4a50","125":"#fdfebc","5":"#da4850","126":"#fefbb9","6":"#d94650","127":"#fef6b0","7":"#dd4f51","128":"#fefebd","8":"#de5151","129":"#fef9b6","9":"#df5351","20":"#e76453","21":"#e66253","22":"#ec6c54","23":"#ed6f55","24":"#eb6a54","25":"#ee7155","26":"#ea6854","27":"#ef7355","28":"#f07556","29":"#f17756","130":"#fafdb8","131":"#fef0a7","132":"#f2faac","133":"#ffffbf","134":"#9bd594","135":"#f6fbb2","136":"#f7fcb3","138":"#f9fcb6","139":"#eaf69f","30":"#f37b56","31":"#f27956","32":"#4898b4","33":"#f68257","34":"#f58057","35":"#fee797","36":"#f47e57","37":"#f2f9aa","38":"#f78457","39":"#fcac6b","140":"#fefdbc","141":"#f6fbb1","142":"#ecf7a2","143":"#f8fcb4","144":"#f4faae","145":"#e8f59b","146":"#f4faaf","147":"#f3faad","148":"#f8fcb5","149":"#f0f9a7","40":"#fc8d59","41":"#fa8a58","42":"#f98858","43":"#f88658","44":"#a1d894","45":"#fc8f5a","46":"#fc915b","47":"#fc985f","48":"#fef1a8","49":"#fdc078","150":"#fefcba","151":"#f1f9a9","152":"#e1f397","153":"#ecf7a1","154":"#edf7a3","155":"#d5ee97","157":"#e6f598","158":"#e6f599","159":"#eef8a4","50":"#fc935d","51":"#9dd694","52":"#fc955e","53":"#fca165","54":"#fc9c62","55":"#fef3ab","56":"#fcb06e","57":"#fef5af","58":"#fafdb7","59":"#fc9e63","160":"#dff297","161":"#bee495","162":"#ddf197","163":"#f5fbb0","164":"#bce395","165":"#e3f497","166":"#99d594","167":"#e9f69d","168":"#d3ed97","169":"#d7ee97","60":"#fef4ac","61":"#ebf7a0","62":"#b8e195","63":"#fc9a61","64":"#fcaa6a","65":"#fdbe76","66":"#feeb9e","67":"#fca567","68":"#fdd081","69":"#fca366","170":"#abdc94","171":"#88c89a","172":"#dbf097","173":"#b4e095","174":"#cdea96","175":"#afde95","176":"#addd95","177":"#cae996","178":"#cfeb96","179":"#7dc09f","70":"#fdb772","72":"#fdbc75","73":"#fef9b5","74":"#fcb36f","75":"#fef7b2","76":"#fee899","77":"#fcb571","78":"#fef2a9","79":"#3288bd","180":"#bae295","181":"#c6e896","182":"#509eb0","183":"#d1ec96","184":"#c0e596","185":"#b1df95","186":"#7fc29d","187":"#c4e796","188":"#c2e696","189":"#93d096","80":"#fdd484","81":"#fef8b3","82":"#fcae6d","83":"#fdc57a","84":"#fdb974","85":"#fdc279","86":"#fefebd","87":"#fee08c","88":"#fdc77c","89":"#d9ef97","190":"#77bca1","191":"#90ce97","192":"#c8e896","193":"#a7db94","194":"#a5da94","195":"#96d295","196":"#a3d994","197":"#8dcc98","198":"#9fd794","199":"#a9db94","90":"#fddd89","91":"#fdce80","92":"#fdcb7e","93":"#eaf69e","94":"#fdc97d","95":"#fee593","96":"#fee28f","97":"#b6e195","98":"#fdd986","99":"#fdd785","200":"#6cb3a5","201":"#82c49c","202":"#85c69b","203":"#7abea0","204":"#53a0af","205":"#5ea9ab","206":"#74b9a2","208":"#6fb5a4","209":"#4294b6","210":"#69b1a6","211":"#66afa7","213":"#72b7a3","214":"#64ada9","215":"#5ba7ac","216":"#58a5ad","218":"#61abaa","219":"#56a3ae","220":"#4d9cb1","100":"#fee08b","221":"#4b9ab3","101":"#fdd282","102":"#fee492","223":"#3f92b7","103":"#fee594","224":"#348abb","104":"#fddb88","225":"#4596b5","105":"#fee18d","226":"#378cba","106":"#eef8a5","227":"#3d90b8","107":"#feeca0","228":"#3a8eb9","108":"#fee390","109":"#feeea2"},"colors":["#D53E4F","#FC8D59","#FEE08B","#FFFFBF","#E6F598","#99D594","#3288BD"]},"name":"民航数据","featureType":"POINT","xyField":{"xField":"longitude","yField":"latitude"},"style":{"strokeWidth":1,"offsetX":0,"fillColor":"#3288bd","offsetY":0,"fillOpacity":0.9,"radius":8,"strokeColor":"#ffffff","type":"BASIC_POINT","strokeOpacity":1},"projection":"EPSG:4326","enableFields":["latitude","longitude","altitude","geometry","机场","X坐标","Y坐标","名次","2017旅客吞吐量（人次）","2016旅客吞吐量（人次）","同比增速%","2017货邮吞吐量（吨）","2016货邮吞吐量（吨）","2017起降架次（架次）","2016起降架次（架次）"],"dataSource":{"accessType":"DIRECT","type":"PORTAL_DATA","serverId":"676516522"}}],"description":"","projection":"EPSG:3857","minScale":"1:591658710.909","title":"民航数据-单值","version":"2.2.1","rootUrl":"https://iportal.supermap.io/iportal/services/../"}

const chart_data = 
{
    "fileName":"民航数据1(1).csv","type":"CSV","lineNumber":222,"content":{"colTitles":["latitude","longitude","altitude","geometry","机场","X坐标","Y坐标","名次","2017旅客吞吐量（人次）","2016旅客吞吐量（人次）","同比增速%","2017货邮吞吐量（吨）","2016货邮吞吐量（吨）","2017起降架次（架次）","2016起降架次（架次）"],"rows":[["40.07108","116.588918","","Point","北京/首都","116.588918","40.07108","1","95786296 ","94393454 ","-1.5","2029584 ","1943160 ","597259 ","606081 "],["31.093992","121.812361","","Point","上海/浦东","121.812361","31.093992","2","70001237 ","66002414 ","3.5","3824280 ","3440280 ","496774 ","479902 "],["23.190697","113.260931","","Point","广州/白云","113.260931","23.190697","3","65806977 ","59732147 ","6.9","1780423 ","1652215 ","465295 ","435231 "],["30.57779","103.9583","","Point","成都/双流","103.9583","30.57779","6","49801693 ","46039037 ","5.5","642872 ","611591 ","337055 ","319382 "],["22.543701","114.10978","","Point","深圳/宝安","114.10978","22.543701","5","45610651 ","41975090 ","6.8","1159019 ","1125985 ","340385 ","318582 "],["25.096153","102.928293","","Point","昆明/长水","102.928293","25.096153","4","44727691 ","41980339 ","7.5","418034 ","382854 ","350273 ","325934 "],["31.17323","121.355241","","Point","上海/虹桥","121.355241","31.17323","10","41884059 ","40460135 ","0.6","407461 ","428908 ","263586 ","261981 "],["34.257972","108.910298","","Point","西安/咸阳","108.910298","34.257972","7","41857229 ","36994506 ","9.6","259873 ","233779 ","318959 ","291027 "],["29.70721","106.63757","","Point","重庆/江北","106.63757","29.70721","8","38715210 ","35888819 ","4.3","366278 ","361091 ","288598 ","276807 "],["30.22899","120.42691","","Point","杭州/萧山","120.42691","30.22899","9","35570411 ","31594959 ","8","589462 ","487984 ","271066 ","251048 "],["31.731089","118.873171","","Point","南京/禄口","118.873171","31.731089","11","25822936 ","22357998 ","11.4","374215 ","341267 ","209394 ","187968 "],["24.534586","118.131845","","Point","厦门/高崎","118.131845","24.534586","13","24485239 ","22737610 ","1.6","338656 ","328420 ","186454 ","183546 "],["34.532784","113.834547","","Point","郑州/新郑","113.834547","34.532784","12","24299073 ","20763217 ","9.9","502715 ","456709 ","195717 ","178054 "],["28.19447","113.21622","","Point","长沙/黄花","113.21622","28.19447","17","23764820 ","21296675 ","6.9","138738 ","130276 ","179575 ","167910 "],["36.26619","120.38719","","Point","青岛/流亭","120.38719","36.26619","16","23210530 ","20505038 ","6.6","232064 ","230748 ","179592 ","168537 "],["30.77615","114.21736","","Point","武汉/天河","114.21736","30.77615","15","23129400 ","20771564 ","4.7","185017 ","175295 ","183883 ","175669 "],["19.93855","110.46215","","Point","海口/美兰","110.46215","19.93855","21","22584815 ","18803848 ","16.2","154496 ","148814 ","157535 ","135523 "],["43.902395","87.474494","","Point","乌鲁木齐/地窝堡","87.474494 ","43.902395","20","\"21","500","901\"","20200767 ","3 ","\"156","741.50\""],["39.119612","117.337137","","Point","天津/滨海","117.337137","39.119612","18","21005001 ","16871889 ","17.9","268284 ","237085 ","169585 ","143822 "],["18.30997","109.40844","","Point","三亚/凤凰","109.40844","18.30997","26","19389936 ","17369550 ","6.1","89116 ","86847 ","121558 ","114581 "],["45.21552","128.27117","","Point","哈尔滨/太平","128.27117","45.21552","24","18810317 ","16267130 ","11.9","121176 ","124795 ","136803 ","122282 "],["27.30739","106.84504","","Point","贵阳/龙洞堡","106.845040 ","27.30739","22","\"18","109","610\"","15105225 ","16 ","\"102","369.70\""],["38.96211","121.546","","Point","大连/周水子","121.546000 ","38.96211","23","\"17","503","810\"","15258209 ","11 ","\"164","777.60\""],["41.639033","123.499642","","Point","沈阳/桃仙","123.499642","41.639033","25","17342626 ","14967228 ","10.6","159117 ","155769 ","127387 ","115164 "],["36.806159","117.234409","","Point","济南/遥墙","117.234409","36.806159","27","14319264 ","11616914 ","15.4","95152 ","100013 ","115529 ","100152 "],["22.60967","108.17172","","Point","南宁/吴圩","108.17172","22.60967","28","13915542 ","11559860 ","14.9","110444 ","104618 ","108049 ","94065 "],["36.33734","104.01974","","Point","兰州/中川","104.01974","36.33734","29","12816443 ","10897025 ","13.8","60906 ","59455 ","103690 ","91091 "],["25.928549","119.672848","","Point","福州/长乐","119.672848","25.928549","31","12469235 ","11606446 ","1.3","125603 ","121658 ","98908 ","97606 "],["37.76528","112.63385","","Point","太原/武宿","112.63385","37.76528","30","12401086 ","9847840 ","22.3","48428 ","49104 ","101076 ","82641 "],["43.98809","125.6899","","Point","长春/龙嘉","125.6899","43.98809","36","11662943 ","9493351 ","17.3","88907 ","86554 ","86041 ","73371 "],["28.85173","115.91209","","Point","南昌/昌北","115.91209","28.85173","34","10937105 ","7863635 ","35.3","52262 ","50608 ","89863 ","66409 "],["40.85965","111.82604","","Point","呼和浩特/白塔","111.82604","40.85965","33","10348617 ","8185210 ","18.3","39611 ","37446 ","96872 ","81873 "],["38.275134","114.69645","","Point","石家庄/正定","114.69645","38.275134","38","9582921 ","7214590 ","17.2","41013 ","43765 ","80492 ","68687 "],["29.81771","121.46942","","Point","宁波/栎社","121.46942","29.81771","43","9390527 ","7792305 ","15.1","120447 ","107020 ","73257 ","63663 "],["27.963421","120.799747","","Point","温州/龙湾","120.799747","27.963421","42","9285621 ","8189717 ","9.7","75532 ","77748 ","74505 ","67916 "],["22.005756","113.381945","","Point","珠海/金湾","113.381945","22.005756","41","9216808 ","6130384 ","21.7","37379 ","31512 ","74694 ","61400 "],["31.975854","117.106396","","Point","合肥/新桥","117.106396","31.975854","40","9147128 ","7391998 ","19.6","63575 ","58097 ","76263 ","63750 "],["38.49154","106.49616","","Point","银川/河东","106.49616","38.49154","45","7936445 ","6341479 ","24.4","42182 ","37107 ","67059 ","53921 "],["25.21118","110.048655","","Point","桂林/两江","110.048655","25.21118","46","7862015 ","6630251 ","12","24188 ","26414 ","64260 ","57387 "],["26.668174","100.253903","","Point","丽江/三义","100.253903","26.668174","50","7105345 ","6784474 ","2","10266 ","9299 ","54250 ","53170 "],["31.503019","120.433096","","Point","无锡/硕放","120.433096","31.503019","52","6683380 ","5561927 ","15.7","107598 ","95984 ","52839 ","45679 "],["37.80597","120.814481","","Point","烟台/蓬莱","120.814481","37.80597","47","6503015 ","5135200 ","21.9","41141 ","43055 ","62105 ","50962 "],["39.792954","116.403072","","Point","北京/南苑","116.403072","39.792954","63","5953883 ","5586388 ","4.6","23205 ","26635 ","41340 ","39507 "],["36.611871","101.80351","","Point","西宁/曹家堡","101.803510 ","36.611871","54","\"5","627","696\"","4681138 ","19 ","\"27","687.20\""],["24.80061","118.59263","","Point","泉州/晋江","118.59263","24.80061","59","5340586 ","3793150 ","30","59278 ","49683 ","43926 ","33787 "],["23.542089","116.511136","","Point","揭阳/潮汕","116.511136","23.542089","53","4851015 ","3818152 ","15.1","26271 ","25243 ","49109 ","42684 "],["22.004287","100.796473","","Point","西双版纳/嘎洒","100.796473","22.004287","69","3990867 ","4335339 ","-8.9","13061 ","10904 ","31925 ","35034 "],["29.651553","91.01721","","Point","拉萨/贡嘎","91.01721","29.651553","67","3718350 ","3339429 ","4.9","32365 ","27687 ","32561 ","31054 "],["31.428986","104.743592","","Point","绵阳/南郊","104.743592","31.428986","19","3543403 ","2172922 ","-11","7225 ","6465 ","169088 ","190062 "],["31.91103","119.78689","","Point","常州/奔牛","119.78689","31.91103","64","2510512 ","1955844 ","55","18871 ","15690 ","40498 ","26121 "],["30.552671","111.484952","","Point","宜昌/三峡","111.484952","30.552671","39","2243812 ","1535707 ","85.5","4206 ","3807 ","76974 ","41504 "],["49.212421","119.82459","","Point","呼伦贝尔/东山","119.82459","49.212421","82","2169197 ","1878901 ","12.3","5000 ","7265 ","18464 ","16443 "],["39.49626","109.87125","","Point","鄂尔多斯/伊金霍洛","109.87125","39.49626","56","2105842 ","1706356 ","3","11816 ","9115 ","45483 ","44162 "],["21.212952","110.363507","","Point","湛江","110.363507","21.212952","74","2090568 ","1503904 ","34.4","5239 ","4239 ","25487 ","18970 "],["40.56451","110.00402","","Point","包头/二里半","110.004020 ","40.56451","77","\"2","089","009\"","1867690 ","18 ","\"8","981.50\""],["39.53719","76.01373","","Point","喀什","76.01373","39.53719","70","2048004 ","1815091 ","57.1","7719 ","6554 ","30679 ","19524 "],["37.194545","122.263127","","Point","威海/大水泊","122.263127 ","37.194545","84","\"2","037","485\"","1735309 ","17 ","\"5","729.00\""],["32.07085","120.98063","","Point","南通/兴东","120.98063","32.07085","72","2009038 ","1538158 ","34.5","39447 ","35371 ","28623 ","21281 "],["34.266663","117.1996","","Point","徐州/观音","117.1996","34.266663","65","1916517 ","1487086 ","24","9233 ","9088 ","36537 ","29470 "],["32.56075","119.718259","","Point","扬州/泰州","119.718259","32.56075","49","1836515 ","1434193 ","45.8","9378 ","8226 ","55503 ","38080 "],["29.104701","110.44981","","Point","张家界/荷花","110.44981","29.104701","85","1773700 ","1701712 ","2.1","1426 ","1014 ","17289 ","16939 "],["38.277279","109.56905","","Point","榆林/榆阳","109.56905","38.277279","83","1771190 ","1513793 ","17.9","4179 ","3709 ","18327 ","15551 "],["21.541408","109.190414","","Point","北海/福成","109.190414","21.541408","88","1711199 ","1234031 ","11.9","5511 ","4655 ","16635 ","14868 "],["24.383558","98.480307","","Point","德宏/芒市","98.480307","24.383558","94","1652533 ","1537536 ","9.9","8511 ","6858 ","13982 ","12726 "],["25.621485","100.282959","","Point","大理","100.282959","25.621485","92","1581271 ","1431116 ","15","5908 ","4123 ","15105 ","13130 "],["27.807408","107.250766","","Point","遵义/新舟","107.250766","27.807408","91","1561066 ","1135432 ","29.1","1618 ","977 ","15310 ","11856 "],["35.11417","111.04361","","Point","运城/张孝","111.04361","35.11417","68","1444590 ","843226 ","94","3173 ","3200 ","32265 ","16634 "],["42.88794","129.44718","","Point","延吉/朝阳川","129.447180 ","42.88794","101","\"1","411","859\"","1481159 ","(10)","\"6","354.60\""],["27.88192","109.31041","","Point","铜仁/凤凰","109.31041","27.88192","80","1344928 ","577645 ","72.9","132 ","55 ","19126 ","11060 "],["35.048242","118.413285","","Point","临沂/沐埠岭","118.413285 ","35.048242","99","\"1","328","071\"","1203387 ","2 ","\"6","128.70\""],["33.428319","120.209716","","Point","盐城/南洋","120.209716","33.428319","98","1302974 ","1209004 ","5.8","5540 ","5118 ","13121 ","12402 "],["29.343513","120.035402","","Point","义乌","120.035402","29.343513","104","1294895 ","1226697 ","-2.9","6871 ","5914 ","10974 ","11302 "],["33.788792","119.131102","","Point","淮安/涟水","119.131102","33.788792","90","1286369 ","861533 ","-33.7","5007 ","4638 ","15385 ","23215 "],["41.62275","86.14375","","Point","库尔勒","86.143750 ","41.62275","100","\"1","279","829\"","1147634 ","11 ","\"7","314.10\""],["25.807514","114.746455","","Point","赣州/黄金","114.746455","25.807514","87","1279798 ","1083240 ","9.9","6629 ","7307 ","16787 ","15269 "],["41.234539","80.31237","","Point","阿克苏/温宿","80.31237","41.234539","105","1276512 ","1103589 ","7.5","6109 ","5171 ","10805 ","10052 "],["42.15647","118.83922","","Point","赤峰/玉龙","118.83922","42.15647","96","1209514 ","1042682 ","6.4","1841 ","1640 ","13563 ","12748 "],["43.957408","81.333375","","Point","伊宁","81.333375","43.957408","108","1151337 ","1041470 ","8.2","4568 ","3904 ","10462 ","9673 "],["24.206411","109.39851","","Point","柳州/白莲","109.39851","24.206411","102","1136021 ","1036219 ","-0.6","5906 ","5410 ","11323 ","11393 "],["27.30215","105.28408","","Point","毕节/飞雄","105.28408","27.30215","95","1110613 ","733605 ","31.1","1046 ","433 ","13708 ","10455 "],["34.57062","118.881624","","Point","连云港/白塔埠","118.881624 ","34.57062","103","\"1","092","924\"","850972 ","21 ","\"1","663.10\""],["37.03968","79.8741","","Point","和田","79.8741","37.03968","115","1030691 ","935314 ","11.9","2262 ","1585 ","8635 ","7714 "],["32.14942","112.29509","","Point","襄阳/刘集","112.29509","32.14942","35","1027010 ","824160 ","7.2","2915 ","2511 ","89270 ","83261 "],["29.932913","122.359352","","Point","舟山/普陀山","122.359352 ","29.932913","76","\"1","023","039\"","800877 ","5 ","196.8","319 "],["39.653049","113.445496","","Point","腾冲/驼峰","113.445496","39.653049","113","997372 ","805638 ","26","2389 ","1444 ","9001 ","7144 "],["35.29364","116.353255","","Point","济宁/曲阜","116.353255","35.29364","118","970860 ","623948 ","40.2","2247 ","1814 ","8122 ","5794 "],["23.046479","114.604937","","Point","惠州/平潭","114.604937","23.046479","114","956858 ","545560 ","65.7","3986 ","3723 ","8670 ","5232 "],["43.5579","122.20957","","Point","通辽","122.20957","43.5579","66","924759 ","710474 ","193.2","1693 ","1472 ","34733 ","11846 "],["25.08118","104.95934","","Point","兴义","104.95934","25.08118","107","922070 ","519653 ","36.5","891 ","243 ","10653 ","7802 "],["34.739214","112.393628","","Point","洛阳/北郊","112.393628","34.739214","14","880253 ","915971 ","4.6","1464 ","1486 ","184810 ","176630 "],["32.586011","110.910913","","Point","十堰/武当山","110.910913 ","32.586011","109","\"869","780\"","388923 ","110 ","","","9905 "],["28.797781","104.550293","","Point","宜宾/菜坝","104.550293","28.797781","117","827867 ","762935 ","3.5","2491 ","2920 ","8201 ","7925 "],["28.55513","121.42171","","Point","台州/路桥","121.42171","28.55513","123","821965 ","691442 ","14.1","6842 ","6720 ","6454 ","5658 "],["44.525407","129.630117","","Point","牡丹江/海浪","129.630117","44.525407","131","784991 ","694286 ","10.6","987 ","1162 ","6122 ","5534 "],["32.98143","112.61982","","Point","南阳/姜营","112.61982","32.98143","48","781563 ","612572 ","19.3","962 ","797 ","57600 ","48272 "],["30.319323","109.489899","","Point","恩施/许家坪","109.489899 ","30.319323","78","\"770","053\"","496148 ","395 ","\"1","202.00\"","989 "],["30.793442","106.168002","","Point","南充/高坪","106.168002","30.793442","55","752668 ","597489 ","158.4","2914 ","3107 ","47904 ","18542 "],["35.402531","119.331616","","Point","日照/山字河","119.331616 ","35.402531","60","\"737","741\"","408507 ","158 ","\"1","026.80\"","457 "],["29.72993","118.260793","","Point","黄山/屯溪","118.260793","29.72993","119","725948 ","604911 ","22.6","2291 ","2067 ","8063 ","6575 "],["36.52425","114.43457","","Point","邯郸","114.43457","36.52425","57","684081 ","462657 ","82.6","703 ","516 ","45328 ","24824 "],["46.821878","130.397278","","Point","佳木斯/东郊","130.397278","46.821878","127","667788 ","455337 ","49.5","1076 ","1081 ","6233 ","4170 "],["30.79449","108.43033","","Point","万州/五桥","108.43033","30.79449","75","656189 ","550727 ","30.7","2502 ","2247 ","22786 ","17438 "],["43.91837","115.96577","","Point","锡林浩特","115.96577","43.91837","81","648455 ","582194 ","-10.8","1526 ","2016 ","18756 ","21016 "],["40.057892","113.486772","","Point","大同/云冈","113.486772","40.057892","73","640095 ","544530 ","44.5","1704 ","1655 ","27666 ","19147 "],["27.97648","102.19101","","Point","西昌/青山","102.19101","27.97648","129","634794 ","469089 ","28.7","1428 ","1242 ","6166 ","4790 "],["42.149956","127.574848","","Point","白山/长白山","127.574848 ","42.149956","120","\"626","884\"","537709 ","14 ","118.5","176 ","7453 "],["26.853318","114.742637","","Point","井冈山","114.742637 ","26.853318","126","\"626","775\"","540865 ","7 ","\"2","219.60\"","3011 "],["29.348585","117.215386","","Point","景德镇/罗家","117.215386","29.348585","150","621880 ","543371 ","9.1","2120 ","1811 ","4638 ","4252 "],["46.719014","125.114334","","Point","大庆/萨尔图","125.114334 ","46.719014","140","\"621","053\"","489354 ","20 ","\"1","399.50\"","1347 "],["32.87722","115.743909","","Point","阜阳","115.743909","32.87722","86","610099 ","450308 ","98.2","533 ","547 ","16969 ","8560 "],["25.051671","99.165713","","Point","保山/云瑞","99.165713","25.051671","133","601307 ","410557 ","52.3","1128 ","835 ","6032 ","3960 "],["40.740649","114.938624","","Point","张家口/宁远","114.938624","40.740649","128","600658 ","351950 ","61.5","123 ","97 ","6173 ","3822 "],["36.646822","119.122362","","Point","潍坊","119.122362","36.646822","125","597763 ","540828 ","-2.2","26469 ","22186 ","6358 ","6499 "],["22.778142","100.973443","","Point","普洱/思茅","100.973443","22.778142","121","581680 ","487808 ","25.3","1079 ","814 ","7156 ","5713 "],["32.64239","117.02933","","Point","迪庆/香格里拉","117.02933","32.64239","124","570974 ","486640 ","25.3","957 ","874 ","6404 ","5112 "],["36.19175","113.08381","","Point","长治/王村","113.08381","36.19175","122","557142 ","741573 ","-27.3","465 ","719 ","6674 ","9175 "],["27.815915","114.401596","","Point","宜春/明月山","114.401596 ","27.815915","130","\"542","727\"","469976 ","21 ","370","275 ","6153 "],["37.506096","118.792213","","Point","东营/胜利","118.792213","37.506096","58","531381 ","377826 ","4.8","329 ","298 ","44240 ","42217 "],["40.136442","94.683541","","Point","敦煌","94.683541","40.136442","138","526779 ","496459 ","-5.7","510 ","518 ","5509 ","5839 "],["32.851353","103.685263","","Point","九寨/黄龙","103.685263","32.851353","148","523130 ","1122223 ","-51.8","196 ","138 ","4888 ","10139 "],["39.724471","117.999197","","Point","唐山/三女河","117.999197 ","39.724471","143","\"519","164\"","240999 ","81 ","\"1","261.00\"","837 "],["49.572574","117.339572","","Point","满洲里/西郊","117.339572","49.572574","136","501682 ","454371 ","5.2","1011 ","1665 ","5672 ","5390 "],["27.724193","118.010691","","Point","武夷山","118.010691 ","27.724193","135","\"493","460\"","455688 ","(0)","826.9","868 ","5832 "],["30.73817","117.690927","","Point","池州/九华山","117.690927 ","30.73817","141","\"475","132\"","355956 ","27 ","408.3","364 ","5430 "],["23.080913","113.075983","","Point","佛山/沙堤","113.075983","23.080913","163","471472 ","355904 ","21.4","243 ","445 ","3381 ","2784 "],["26.718615","112.621995","","Point","衡阳/南岳","112.621995","26.718615","146","470519 ","311549 ","36.2","602 ","882 ","4962 ","3644 "],["29.497729","94.580436","","Point","林芝/米林","94.580436","29.497729","144","467879 ","389530 ","23.7","1943 ","1654 ","5256 ","4248 "],["30.580776","117.055412","","Point","安庆","117.055412","30.580776","147","459170 ","325634 ","25.9","1434 ","1418 ","4904 ","3894 "],["39.79159","106.80817","","Point","乌海","106.80817","39.79159","132","454296 ","339824 ","49.5","599 ","988 ","6083 ","4069 "],["28.916307","111.643672","","Point","常德/桃花源","111.643672 ","28.916307","37","\"438","362\"","413484 ","(6)","368.7","258 ","83847 "],["39.815459","98.340651","","Point","嘉峪关","98.340651 ","39.815459","151","\"434","483\"","399401 ","(5)","\"1","616.10\"","1704 "],["26.971508","107.989467","","Point","凯里/黄平","107.989467","26.971508","112","425155 ","94137 ","61.7","1 ","","9476 ","5862 "],["31.128664","107.434035","","Point","达州/河市","107.434035","31.128664","149","424496 ","402691 ","4.1","1464 ","1475 ","4752 ","4563 "],["26.25399","105.87646","","Point","安顺/黄果树105.876460 ","26.25399","137","\"421","517\"","250798 ","24 ","897.2","958 ","5652 ","4545 "],["33.150225","107.334352","","Point","汉中/城固","107.334352","33.150225","106","414361 ","195178 ","403.2","631 ","402 ","10753 ","2137 "],["47.25401","123.92377","","Point","齐齐哈尔/三家子","123.923770 ","47.25401","159","\"403","008\"","322120 ","20 ","582.3","833 ","3556 "],["23.897171","100.086549","","Point","临沧","100.086549","23.897171","154","399406 ","353467 ","22.4","751 ","670 ","3918 ","3200 "],["26.362772","115.371323","","Point","梅县/长岗岌","115.371323 ","26.362772","142","\"397","857\"","335974 ","6 ","126.9","194 ","5414 "],["28.84208","105.38312","","Point","泸州/蓝田","105.38312","28.84208","153","395575 ","985108 ","-60","1062 ","3293 ","3996 ","9992 "],["45.4683","84.95947","","Point","克拉玛依","84.95947","45.4683","61","389677 ","272585 ","3.6","281 ","211 ","43089 ","41598 "],["26.605323","104.980987","","Point","六盘水/月照","104.980987","26.605323","139","385141 ","227958 ","40.7","48 ","51 ","5484 ","3898 "],["35.80088","107.61048","","Point","庆阳","107.61048","35.80088","93","337346 ","324790 ","-23.3","49 ","38 ","14749 ","19234 "],["36.63886","109.55704","","Point","延安/二十里堡","109.55704","36.63886","167","333724 ","236909 ","36.4","346 ","217 ","3119 ","2287 "],["39.85273","119.47154","","Point","秦皇岛/北戴河","119.471540 ","39.85273","110","\"328","473\"","231240 ","176 ","506.2","426 ","9699 "],["41.033569","113.135849","","Point","乌兰察布/集宁","113.135849","41.033569","145","324128 ","66507 ","329.8","3 ","","5171 ","1203 "],["19.155447","110.557769","","Point","琼海/博鳌","110.557769","19.155447","116","316246 ","10696 ","622.9","52 ","2 ","8523 ","1179 "],["42.8184","93.76535","","Point","哈密","93.76535","42.8184","158","299625 ","163528 ","66.4","483 ","410 ","3693 ","2220 "],["41.68274","82.87683","","Point","库车/龟兹","82.87683","41.68274","157","295001 ","273695 ","17.8","380 ","293 ","3745 ","3178 "],["29.5145","108.834","","Point","黔江/武陵山","108.834000 ","29.5145","165","\"288","749\"","153443 ","59 ","120.5","78 ","3320 "],["40.8859","107.701086","","Point","巴彦淖尔/天吉泰","107.701086 ","40.8859","152","\"282","874\"","273136 ","(2)","595.6","891 ","3997 "],["27.3244","103.75462","","Point","昭通","103.754620 ","27.3244","160","\"280","639\"","224051 ","17 ","249.4","84 ","3470 "],["37.528343","111.173422","","Point","吕梁/大武","111.173422","37.528343","162","275786 ","213797 ","17.2","43 ","21 ","3406 ","2906 "],["26.534456","101.799265","","Point","攀枝花/保安营","101.799265 ","26.534456","172","\"272","926\"","228508 ","15 ","\"1","345.70\"","1154 "],["32.39271","105.70477","","Point","广元/盘龙","105.70477","32.39271","89","265256 ","236664 ","518.9","320 ","293 ","15397 ","2488 "],["32.839047","97.033822","","Point","玉树/巴塘","97.033822","32.839047","169","263706 ","181215 ","48.6","722 ","387 ","3106 ","2090 "],["38.413956","112.729334","","Point","忻州/五台山","112.729334 ","38.413956","155","\"261","146\"","111585 ","115 ","25.8","11 ","3864 "],["36.099706","111.616682","","Point","临汾/乔李","111.616682","36.099706","168","254290 ","151093 ","43.3","780 ","175 ","3116 ","2174 "],["41.089196","121.153656","","Point","锦州/锦州湾","121.153656 ","41.089196","183","\"232","715\"","158154 ","33 ","911.8","829 ","2110 "],["30.551642","97.114994","","Point","昌都/邦达","97.114994","30.551642","178","231235 ","225666 ","2.2","714 ","976 ","2252 ","2204 "],["45.299703","131.208834","","Point","鸡西/兴凯湖","131.208834 ","45.299703","174","\"222","125\"","190754 ","32 ","257","313 ","2752 "],["40.630024","122.424715","","Point","营口/兰旗","122.424715","40.630024","177","205528 ","115468 ","62.3","188 ","26 ","2459 ","1515 "],["28.96474","118.88025","","Point","衢州","118.88025","28.96474","192","202620 ","208219 ","-2.4","602 ","639 ","1652 ","1692 "],["41.095239","122.879127","","Point","鞍山/腾鳌","122.879127","41.095239","181","199279 ","152647 ","17.8","16 ","17 ","2234 ","1896 "],["29.307956","100.068154","","Point","稻城/亚丁","100.068154","29.307956","187","198952 ","186350 ","-2.5","268 ","206 ","1930 ","1980 "],["40.03342","124.28688","","Point","丹东/浪头","124.28688","40.03342","188","198498 ","211516 ","-16.6","1218 ","1623 ","1901 ","2280 "],["26.400633","117.792475","","Point","三明/沙县","117.792475","26.400633","184","198272 ","69734 ","36.8","374 ","81 ","2095 ","1531 "],["27.44155","109.70564","","Point","怀化/芷江","109.70564","27.44155","161","180497 ","115518 ","75.5","2 ","10 ","3416 ","1946 "],["34.555065","105.868786","","Point","天水/麦积山","105.868786 ","34.555065","164","\"178","227\"","109207 ","38 ","52.3","38 ","3340 "],["36.437993","94.772246","","Point","格尔木","94.772246 ","36.437993","180","\"172","266\"","149056 ","13 ","861.9","678 ","2238 "],["37.57652","105.14125","","Point","中卫/香山","105.14125","37.57652","62","159744 ","102834 ","5.7","127 ","90 ","42321 ","40046 "],["36.014478","106.285358","","Point","固原/六盘山","106.285358 ","36.014478","97","\"157","183\"","107358 ","63 ","15.1","8 ","13241 "],["28.727072","100.571465","","Point","阿尔山/伊尔施","100.571465 ","28.727072","173","\"155","187\"","105043 ","60 ","384.3","443 ","2758 "],["38.495919","102.332214","","Point","金昌/金川","102.332214","38.495919","185","152606 ","114797 ","-40.7","103 ","139 ","2075 ","3502 "],["50.17957","127.3203","","Point","黑河","127.3203","50.17957","175","150692 ","140752 ","0.5","72 ","65 ","2698 ","2684 "],["43.031421","89.102427","","Point","吐鲁番/交河","89.102427","43.031421","176","147653 ","55373 ","94.3","1157 ","101 ","2642 ","1360 "],["50.37518","124.11834","","Point","加格达奇","124.11834","50.37518","170","147417 ","132221 ","7.4","50 ","37 ","2977 ","2772 "],["41.127874","118.080298","","Point","承德/普宁","118.080298","41.127874","199","146979 ","","","3 ","","1352 ","undefined"],["28.419874","117.899436","","Point","上饶/三清山","117.899436 ","28.419874","193","\"146","655\"","","","6.6","","1634 "],["25.690503","116.76488","","Point","连城/冠豸山","116.764880 ","25.690503","194","\"142","794\"","115931 ","(0)","224.5","96 ","1604 "],["38.901196","100.603731","","Point","张掖/甘州","100.603731","38.901196","196","138292 ","117637 ","51.8","137 ","90 ","1576 ","1576 "],["41.510985","120.441863","","Point","朝阳","120.441863","41.510985","44","136221 ","132273 ","-15.6","15 ","85 ","70461 ","83469 "],["47.731753","128.893249","","Point","伊春/林都","128.893249","47.731753","198","135326 ","122081 ","10.5","53 ","44 ","1407 ","1273 "],["44.898276","82.303703","","Point","博乐/阿拉山口","82.303703","44.898276","51","134269 ","129030 ","2.5","113 ","55 ","52964 ","51666 "],["38.746409","105.644472","","Point","阿拉善左旗/巴彦浩特","105.644472","38.746409","134","121884 ","56690 ","109.2","0 ","","5997 ","2866 "],["48.22439","87.00544","","Point","布尔津/喀纳斯","87.00544","48.22439","166","121284 ","99574 ","182.9","4 ","3 ","3126 ","1105 "],["26.3413","111.6179","","Point","永州/零陵","111.6179","26.3413","195","120824 ","112039 ","-1.4","15 ","49 ","1594 ","1616 "],["34.813611","102.68478","","Point","甘南/夏河","102.68478","34.813611","189","118282 ","91556 ","31.3","304 ","249 ","1888 ","1438 "],["30.140162","101.741137","","Point","甘孜/康定","101.741137","30.140162","191","116324 ","133669 ","-2.6","48 ","13 ","1782 ","1830 "],["23.735025","106.907509","","Point","百色/巴马","106.907509","23.735025","197","109918 ","99489 ","-0.8","6 ","","1522 ","1534 "],["23.603423","104.346325","","Point","文山/普者黑","104.346325","23.603423","111","108571 ","91699 ","751","291 ","254 ","9582 ","1126 "],["47.75357","88.09164","","Point","阿勒泰","88.091640 ","47.75357","171","\"105","301\"","298486 ","(40)","87.8","184 ","2917 "],["42.056477","125.762534","","Point","通化/三源浦","125.762534 ","42.056477","202","\"104","234\"","74831 ","(5)","","0 ","1106 "],["27.800021","107.253395","","Point","遵义/茅台","107.253395","27.800021","201","101563 ","","","","","1188 ","undefined"],["25.44036","107.96531","","Point","黔南州/荔波","107.96531","25.44036","186","101462 ","46242 ","64","1 ","1 ","1984 ","1210 "],["26.31713","109.15841","","Point","黎平","109.15841","26.31713","179","93382 ","47358 ","71.8","12 ","1 ","2250 ","1310 "],["43.4305","83.3795","","Point","那拉提","83.379500 ","43.4305","203","\"84","491\"","92634 ","(7)","105.5","44 ","1092 "],["52.947719","122.345831","","Point","漠河/古莲","122.345831","52.947719","190","83801 ","72505 ","5.5","77 ","45 ","1872 ","1774 "],["26.797136","110.64856","","Point","邵阳/武冈","110.64856","26.797136","206","82232 ","","","2 ","","937 ","undefined"],["23.267237","99.365303","","Point","沧源/佤山","99.365303","23.267237","213","81945 ","2773 ","3272.7","24 ","","742 ","22 "],["37.133107","97.262543","","Point","海西/德令哈","97.262543 ","37.133107","208","\"81","661\"","62961 ","27 ","228.5","64 ","926 "],["44.305886","86.041075","","Point","石河子/花园","86.041075","44.305886","200","80949 ","38646 ","68.1","111 ","3 ","1210 ","720 "],["46.67072","83.34263","","Point","塔城","83.34263","46.67072","210","74724 ","138353 ","-50.1","18 ","22 ","858 ","1718 "],["30.132689","122.769531","","Point","抚远/东极","122.769531","30.132689","211","65148 ","62509 ","1.9","2 ","1 ","852 ","836 "],["29.352523","89.318596","","Point","日喀则","89.318596 ","29.352523","214","\"64","539\"","48132 ","22 ","311.4","257 ","739 "],["22.335874","99.589631","","Point","澜沧/景迈","99.589631","22.335874","218","61407 ","","","1 ","","584 ","undefined"],["47.747101","122.831184","","Point","扎兰屯/成吉思汗","122.831184","47.747101","205","56675 ","432 ","13150","0 ","","1060 ","8 "],["38.14462","85.53609","","Point","且末","85.53609","38.14462","215","50762 ","1464 ","4437.5","5 ","","726 ","16 "],["16.824674","112.33768","","Point","三沙/永兴","112.33768","16.824674","216","49810 ","759 ","4375","10 ","","716 ","16 "],["27.65296","100.80829","","Point","宁蒗/泸沽湖","100.808290 ","27.65296","219","\"47","439\"","40090 ","11 ","26","2 ","454 "],["43.629272","122.292213","","Point","霍林河","122.292213 ","43.629272","204","\"47","010\"","","","0.2","","1068 "],["36.894039","98.786598","","Point","富蕴/可可托海","98.786598","36.894039","182","41796 ","38805 ","222.3","37 ","8 ","2224 ","690 "],["38.200017","90.841982","","Point","海西/花土沟","90.841982 ","38.200017","220","\"38","935\"","24082 ","85 ","6.9","","451 "],["45.505303","123.023483","","Point","白城/长安","123.023483","45.505303","221","31439 ","","","0 ","","438 ","undefined"],["23.45351","111.25557","","Point","梧州/长州岛","111.255570 ","23.45351","32","\"27","475\"","70639 ","3 ","7.5","21 ","98260 "],["44.94196","124.559594","","Point","松原/查干湖","124.559594 ","44.94196","225","\"24","231\"","","","0.7","","386 "],["40.625729","107.056274","","Point","额济纳旗/桃来","107.056274","40.625729","209","23843 ","17264 ","55.1","0 ","0 ","881 ","568 "],["24.71394","107.842501","","Point","河池/金城江","107.842501 ","24.71394","223","\"14","083\"","30299 ","(37)","","","419 "],["32.529552","102.354863","","Point","阿坝/红原","102.354863","32.529552","227","12541 ","24713 ","-39.3","","","210 ","346 "],["47.106369","132.670313","","Point","建三江/湿地","132.670313","47.106369","228","11695 ","","","","","136 ","undefined"],["31.672834","110.429298","","Point","神农架/红坪","110.429298","31.672834","226","10299 ","18074 ","-7.5","","","322 ","348 "],["39.243991","122.668699","","Point","长海/大长山岛","122.668699","39.243991","224","2958 ","3392 ","-14.1","","","401 ","467 "],["32.70707","108.93981","","Point","安康","108.93981","32.70707","79","","","82.1","","","19485 ","10700 "
]]}}

const prj_data = {"distanceUnit":"METER","projectionParam":null,"epsgCode":4326,"coordUnit":"DEGREE","name":"GCS_WGS_1984","projection":null,"type":"PCS_EARTH_LONGITUDE_LATITUDE","coordSystem":{"datum":{"name":"D_WGS_1984","type":"DATUM_WGS_1984","spheroid":{"flatten":0.0033528106647474805,"name":"WGS_1984","axis":6378137,"type":"SPHEROID_WGS_1984"}},"unit":"DEGREE","spatialRefType":"SPATIALREF_EARTH_LONGITUDE_LATITUDE","name":"GCS_WGS_1984","type":"GCS_WGS_1984","primeMeridian":{"longitudeValue":0,"name":"Greenwich","type":"PRIMEMERIDIAN_GREENWICH"}}}

const dataset_data ={"childUriList":["https://iserver.supermap.io/iserver/services/data-world/rest/data/datasources/World/datasets/Countries/fields","https://iserver.supermap.io/iserver/services/data-world/rest/data/datasources/World/datasets/Countries/features","https://iserver.supermap.io/iserver/services/data-world/rest/data/datasources/World/datasets/Countries/domain"],"supportAttachments":true,"supportFeatureMetadatas":false,"datasetInfo":{"charset":"UTF8","recordCount":1889,"isFileCache":false,"description":"NULL","type":"REGION","dataSourceName":"World","tableName":"SMDTV_97","isReadOnly":false,"encodeType":"NONE","bounds":{"top":83.62359619140626,"left":-180,"bottom":-90,"leftBottom":{"x":-180,"y":-90},"right":180,"rightTop":{"x":180,"y":83.62359619140626}},"name":"Countries","prjCoordSys":{"distanceUnit":"METER","projectionParam":null,"epsgCode":4326,"coordUnit":"DEGREE","name":"Longitude / Latitude Coordinate System---GCS_WGS_1984","projection":null,"type":"PCS_EARTH_LONGITUDE_LATITUDE","coordSystem":{"datum":{"name":"D_WGS_1984","type":"DATUM_WGS_1984","spheroid":{"flatten":0.00335281066474748,"name":"WGS_1984","axis":6378137,"type":"SPHEROID_WGS_1984"}},"unit":"DEGREE","spatialRefType":"SPATIALREF_EARTH_LONGITUDE_LATITUDE","name":"GCS_WGS_1984","type":"GCS_WGS_1984","primeMeridian":{"longitudeValue":0,"name":"Greenwich","type":"PRIMEMERIDIAN_GREENWICH"}}},"datasourceConnectionInfo":null}}

const datas_chart = {"dataMetaInfo":{"firstRowIsHead":true,"previewURL":null,"fileEncoding":null,"proxiedServiceType":null,"hasScene":false,"xIndex":"1","yField":null,"yIndex":"0","separator":",","url":null,"baseLayerType":null,"xField":null,"epsgCode":0,"realspaceType":null,"releaseTimeMilli":0,"fieldTypes":["NUMBER","NUMBER","STRING","STRING","STRING","NUMBER","NUMBER","NUMBER","NUMBER","NUMBER","NUMBER","NUMBER","NUMBER","NUMBER","NUMBER"],"bounds":null,"proxiedServiceUrl":null,"providers":null},"lastModfiedTime":1600534952481,"fileName":"民航数据1(1).csv","thumbnail":"https://iportal.supermap.io/iportal/services/../web/static/portal/img/map/cloud.png","dataItemServices":[],"dataCheckResult":{"serviceCheckInfos":[],"dataCheckInfo":null},"publishInfo":null,"authorizeSetting":[{"aliasName":"iclient","entityRoles":[],"entityType":"USER","entityName":"iclient","dataPermissionType":"DELETE","entityId":null},{"aliasName":"GUEST","entityRoles":[],"entityType":"USER","entityName":"GUEST","dataPermissionType":"DOWNLOAD","entityId":null}],"description":null,"userName":"iclient","type":"CSV","tags":[],"coordType":null,"size":24782,"createTime":1595486513403,"serviceStatus":"UNPUBLISHED","nickname":"iclient","id":123,"serviceId":null,"downloadCount":19,"storageId":"7p57k4bl_9dp78ahh_acc2f288_9012_4d12_ae0e_acbe770776c1","status":"OK","MD5":"6c28cbde8eaeff1816441f5ac636c1a1"}

const datas_charts = {"fileName":"民航数据1(1).csv","type":"CSV","lineNumber":222,"content":{"colTitles":["latitude","longitude","altitude","geometry","机场","X坐标","Y坐标","名次","2017旅客吞吐量（人次）","2016旅客吞吐量（人次）","同比增速%","2017货邮吞吐量（吨）","2016货邮吞吐量（吨）","2017起降架次（架次）","2016起降架次（架次）"],"rows":[["40.07108","116.588918","","Point","北京/首都","116.588918","40.07108","1","95786296 ","94393454 ","-1.5","2029584 ","1943160 ","597259 ","606081 "],["31.093992","121.812361","","Point","上海/浦东","121.812361","31.093992","2","70001237 ","66002414 ","3.5","3824280 ","3440280 ","496774 ","479902 "],["23.190697","113.260931","","Point","广州/白云","113.260931","23.190697","3","65806977 ","59732147 ","6.9","1780423 ","1652215 ","465295 ","435231 "],["30.57779","103.9583","","Point","成都/双流","103.9583","30.57779","6","49801693 ","46039037 ","5.5","642872 ","611591 ","337055 ","319382 "],["22.543701","114.10978","","Point","深圳/宝安","114.10978","22.543701","5","45610651 ","41975090 ","6.8","1159019 ","1125985 ","340385 ","318582 "],["25.096153","102.928293","","Point","昆明/长水","102.928293","25.096153","4","44727691 ","41980339 ","7.5","418034 ","382854 ","350273 ","325934 "],["31.17323","121.355241","","Point","上海/虹桥","121.355241","31.17323","10","41884059 ","40460135 ","0.6","407461 ","428908 ","263586 ","261981 "],["34.257972","108.910298","","Point","西安/咸阳","108.910298","34.257972","7","41857229 ","36994506 ","9.6","259873 ","233779 ","318959 ","291027 "],["29.70721","106.63757","","Point","重庆/江北","106.63757","29.70721","8","38715210 ","35888819 ","4.3","366278 ","361091 ","288598 ","276807 "],["30.22899","120.42691","","Point","杭州/萧山","120.42691","30.22899","9","35570411 ","31594959 ","8","589462 ","487984 ","271066 ","251048 "],["31.731089","118.873171","","Point","南京/禄口","118.873171","31.731089","11","25822936 ","22357998 ","11.4","374215 ","341267 ","209394 ","187968 "],["24.534586","118.131845","","Point","厦门/高崎","118.131845","24.534586","13","24485239 ","22737610 ","1.6","338656 ","328420 ","186454 ","183546 "],["34.532784","113.834547","","Point","郑州/新郑","113.834547","34.532784","12","24299073 ","20763217 ","9.9","502715 ","456709 ","195717 ","178054 "],["28.19447","113.21622","","Point","长沙/黄花","113.21622","28.19447","17","23764820 ","21296675 ","6.9","138738 ","130276 ","179575 ","167910 "],["36.26619","120.38719","","Point","青岛/流亭","120.38719","36.26619","16","23210530 ","20505038 ","6.6","232064 ","230748 ","179592 ","168537 "],["30.77615","114.21736","","Point","武汉/天河","114.21736","30.77615","15","23129400 ","20771564 ","4.7","185017 ","175295 ","183883 ","175669 "],["19.93855","110.46215","","Point","海口/美兰","110.46215","19.93855","21","22584815 ","18803848 ","16.2","154496 ","148814 ","157535 ","135523 "],["43.902395","87.474494","","Point","乌鲁木齐/地窝堡","87.474494 ","43.902395","20","\"21","500","901\"","20200767 ","3 ","\"156","741.50\""],["39.119612","117.337137","","Point","天津/滨海","117.337137","39.119612","18","21005001 ","16871889 ","17.9","268284 ","237085 ","169585 ","143822 "],["18.30997","109.40844","","Point","三亚/凤凰","109.40844","18.30997","26","19389936 ","17369550 ","6.1","89116 ","86847 ","121558 ","114581 "],["45.21552","128.27117","","Point","哈尔滨/太平","128.27117","45.21552","24","18810317 ","16267130 ","11.9","121176 ","124795 ","136803 ","122282 "],["27.30739","106.84504","","Point","贵阳/龙洞堡","106.845040 ","27.30739","22","\"18","109","610\"","15105225 ","16 ","\"102","369.70\""],["38.96211","121.546","","Point","大连/周水子","121.546000 ","38.96211","23","\"17","503","810\"","15258209 ","11 ","\"164","777.60\""],["41.639033","123.499642","","Point","沈阳/桃仙","123.499642","41.639033","25","17342626 ","14967228 ","10.6","159117 ","155769 ","127387 ","115164 "],["36.806159","117.234409","","Point","济南/遥墙","117.234409","36.806159","27","14319264 ","11616914 ","15.4","95152 ","100013 ","115529 ","100152 "],["22.60967","108.17172","","Point","南宁/吴圩","108.17172","22.60967","28","13915542 ","11559860 ","14.9","110444 ","104618 ","108049 ","94065 "],["36.33734","104.01974","","Point","兰州/中川","104.01974","36.33734","29","12816443 ","10897025 ","13.8","60906 ","59455 ","103690 ","91091 "],["25.928549","119.672848","","Point","福州/长乐","119.672848","25.928549","31","12469235 ","11606446 ","1.3","125603 ","121658 ","98908 ","97606 "],["37.76528","112.63385","","Point","太原/武宿","112.63385","37.76528","30","12401086 ","9847840 ","22.3","48428 ","49104 ","101076 ","82641 "],["43.98809","125.6899","","Point","长春/龙嘉","125.6899","43.98809","36","11662943 ","9493351 ","17.3","88907 ","86554 ","86041 ","73371 "],["28.85173","115.91209","","Point","南昌/昌北","115.91209","28.85173","34","10937105 ","7863635 ","35.3","52262 ","50608 ","89863 ","66409 "],["40.85965","111.82604","","Point","呼和浩特/白塔","111.82604","40.85965","33","10348617 ","8185210 ","18.3","39611 ","37446 ","96872 ","81873 "],["38.275134","114.69645","","Point","石家庄/正定","114.69645","38.275134","38","9582921 ","7214590 ","17.2","41013 ","43765 ","80492 ","68687 "],["29.81771","121.46942","","Point","宁波/栎社","121.46942","29.81771","43","9390527 ","7792305 ","15.1","120447 ","107020 ","73257 ","63663 "],["27.963421","120.799747","","Point","温州/龙湾","120.799747","27.963421","42","9285621 ","8189717 ","9.7","75532 ","77748 ","74505 ","67916 "],["22.005756","113.381945","","Point","珠海/金湾","113.381945","22.005756","41","9216808 ","6130384 ","21.7","37379 ","31512 ","74694 ","61400 "],["31.975854","117.106396","","Point","合肥/新桥","117.106396","31.975854","40","9147128 ","7391998 ","19.6","63575 ","58097 ","76263 ","63750 "],["38.49154","106.49616","","Point","银川/河东","106.49616","38.49154","45","7936445 ","6341479 ","24.4","42182 ","37107 ","67059 ","53921 "],["25.21118","110.048655","","Point","桂林/两江","110.048655","25.21118","46","7862015 ","6630251 ","12","24188 ","26414 ","64260 ","57387 "],["26.668174","100.253903","","Point","丽江/三义","100.253903","26.668174","50","7105345 ","6784474 ","2","10266 ","9299 ","54250 ","53170 "],["31.503019","120.433096","","Point","无锡/硕放","120.433096","31.503019","52","6683380 ","5561927 ","15.7","107598 ","95984 ","52839 ","45679 "],["37.80597","120.814481","","Point","烟台/蓬莱","120.814481","37.80597","47","6503015 ","5135200 ","21.9","41141 ","43055 ","62105 ","50962 "],["39.792954","116.403072","","Point","北京/南苑","116.403072","39.792954","63","5953883 ","5586388 ","4.6","23205 ","26635 ","41340 ","39507 "],["36.611871","101.80351","","Point","西宁/曹家堡","101.803510 ","36.611871","54","\"5","627","696\"","4681138 ","19 ","\"27","687.20\""],["24.80061","118.59263","","Point","泉州/晋江","118.59263","24.80061","59","5340586 ","3793150 ","30","59278 ","49683 ","43926 ","33787 "],["23.542089","116.511136","","Point","揭阳/潮汕","116.511136","23.542089","53","4851015 ","3818152 ","15.1","26271 ","25243 ","49109 ","42684 "],["22.004287","100.796473","","Point","西双版纳/嘎洒","100.796473","22.004287","69","3990867 ","4335339 ","-8.9","13061 ","10904 ","31925 ","35034 "],["29.651553","91.01721","","Point","拉萨/贡嘎","91.01721","29.651553","67","3718350 ","3339429 ","4.9","32365 ","27687 ","32561 ","31054 "],["31.428986","104.743592","","Point","绵阳/南郊","104.743592","31.428986","19","3543403 ","2172922 ","-11","7225 ","6465 ","169088 ","190062 "],["31.91103","119.78689","","Point","常州/奔牛","119.78689","31.91103","64","2510512 ","1955844 ","55","18871 ","15690 ","40498 ","26121 "],["30.552671","111.484952","","Point","宜昌/三峡","111.484952","30.552671","39","2243812 ","1535707 ","85.5","4206 ","3807 ","76974 ","41504 "],["49.212421","119.82459","","Point","呼伦贝尔/东山","119.82459","49.212421","82","2169197 ","1878901 ","12.3","5000 ","7265 ","18464 ","16443 "],["39.49626","109.87125","","Point","鄂尔多斯/伊金霍洛","109.87125","39.49626","56","2105842 ","1706356 ","3","11816 ","9115 ","45483 ","44162 "],["21.212952","110.363507","","Point","湛江","110.363507","21.212952","74","2090568 ","1503904 ","34.4","5239 ","4239 ","25487 ","18970 "],["40.56451","110.00402","","Point","包头/二里半","110.004020 ","40.56451","77","\"2","089","009\"","1867690 ","18 ","\"8","981.50\""],["39.53719","76.01373","","Point","喀什","76.01373","39.53719","70","2048004 ","1815091 ","57.1","7719 ","6554 ","30679 ","19524 "],["37.194545","122.263127","","Point","威海/大水泊","122.263127 ","37.194545","84","\"2","037","485\"","1735309 ","17 ","\"5","729.00\""],["32.07085","120.98063","","Point","南通/兴东","120.98063","32.07085","72","2009038 ","1538158 ","34.5","39447 ","35371 ","28623 ","21281 "],["34.266663","117.1996","","Point","徐州/观音","117.1996","34.266663","65","1916517 ","1487086 ","24","9233 ","9088 ","36537 ","29470 "],["32.56075","119.718259","","Point","扬州/泰州","119.718259","32.56075","49","1836515 ","1434193 ","45.8","9378 ","8226 ","55503 ","38080 "],["29.104701","110.44981","","Point","张家界/荷花","110.44981","29.104701","85","1773700 ","1701712 ","2.1","1426 ","1014 ","17289 ","16939 "],["38.277279","109.56905","","Point","榆林/榆阳","109.56905","38.277279","83","1771190 ","1513793 ","17.9","4179 ","3709 ","18327 ","15551 "],["21.541408","109.190414","","Point","北海/福成","109.190414","21.541408","88","1711199 ","1234031 ","11.9","5511 ","4655 ","16635 ","14868 "],["24.383558","98.480307","","Point","德宏/芒市","98.480307","24.383558","94","1652533 ","1537536 ","9.9","8511 ","6858 ","13982 ","12726 "],["25.621485","100.282959","","Point","大理","100.282959","25.621485","92","1581271 ","1431116 ","15","5908 ","4123 ","15105 ","13130 "],["27.807408","107.250766","","Point","遵义/新舟","107.250766","27.807408","91","1561066 ","1135432 ","29.1","1618 ","977 ","15310 ","11856 "],["35.11417","111.04361","","Point","运城/张孝","111.04361","35.11417","68","1444590 ","843226 ","94","3173 ","3200 ","32265 ","16634 "],["42.88794","129.44718","","Point","延吉/朝阳川","129.447180 ","42.88794","101","\"1","411","859\"","1481159 ","(10)","\"6","354.60\""],["27.88192","109.31041","","Point","铜仁/凤凰","109.31041","27.88192","80","1344928 ","577645 ","72.9","132 ","55 ","19126 ","11060 "],["35.048242","118.413285","","Point","临沂/沐埠岭","118.413285 ","35.048242","99","\"1","328","071\"","1203387 ","2 ","\"6","128.70\""],["33.428319","120.209716","","Point","盐城/南洋","120.209716","33.428319","98","1302974 ","1209004 ","5.8","5540 ","5118 ","13121 ","12402 "],["29.343513","120.035402","","Point","义乌","120.035402","29.343513","104","1294895 ","1226697 ","-2.9","6871 ","5914 ","10974 ","11302 "],["33.788792","119.131102","","Point","淮安/涟水","119.131102","33.788792","90","1286369 ","861533 ","-33.7","5007 ","4638 ","15385 ","23215 "],["41.62275","86.14375","","Point","库尔勒","86.143750 ","41.62275","100","\"1","279","829\"","1147634 ","11 ","\"7","314.10\""],["25.807514","114.746455","","Point","赣州/黄金","114.746455","25.807514","87","1279798 ","1083240 ","9.9","6629 ","7307 ","16787 ","15269 "],["41.234539","80.31237","","Point","阿克苏/温宿","80.31237","41.234539","105","1276512 ","1103589 ","7.5","6109 ","5171 ","10805 ","10052 "],["42.15647","118.83922","","Point","赤峰/玉龙","118.83922","42.15647","96","1209514 ","1042682 ","6.4","1841 ","1640 ","13563 ","12748 "],["43.957408","81.333375","","Point","伊宁","81.333375","43.957408","108","1151337 ","1041470 ","8.2","4568 ","3904 ","10462 ","9673 "],["24.206411","109.39851","","Point","柳州/白莲","109.39851","24.206411","102","1136021 ","1036219 ","-0.6","5906 ","5410 ","11323 ","11393 "],["27.30215","105.28408","","Point","毕节/飞雄","105.28408","27.30215","95","1110613 ","733605 ","31.1","1046 ","433 ","13708 ","10455 "],["34.57062","118.881624","","Point","连云港/白塔埠","118.881624 ","34.57062","103","\"1","092","924\"","850972 ","21 ","\"1","663.10\""],["37.03968","79.8741","","Point","和田","79.8741","37.03968","115","1030691 ","935314 ","11.9","2262 ","1585 ","8635 ","7714 "],["32.14942","112.29509","","Point","襄阳/刘集","112.29509","32.14942","35","1027010 ","824160 ","7.2","2915 ","2511 ","89270 ","83261 "],["29.932913","122.359352","","Point","舟山/普陀山","122.359352 ","29.932913","76","\"1","023","039\"","800877 ","5 ","196.8","319 "],["39.653049","113.445496","","Point","腾冲/驼峰","113.445496","39.653049","113","997372 ","805638 ","26","2389 ","1444 ","9001 ","7144 "],["35.29364","116.353255","","Point","济宁/曲阜","116.353255","35.29364","118","970860 ","623948 ","40.2","2247 ","1814 ","8122 ","5794 "],["23.046479","114.604937","","Point","惠州/平潭","114.604937","23.046479","114","956858 ","545560 ","65.7","3986 ","3723 ","8670 ","5232 "],["43.5579","122.20957","","Point","通辽","122.20957","43.5579","66","924759 ","710474 ","193.2","1693 ","1472 ","34733 ","11846 "],["25.08118","104.95934","","Point","兴义","104.95934","25.08118","107","922070 ","519653 ","36.5","891 ","243 ","10653 ","7802 "],["34.739214","112.393628","","Point","洛阳/北郊","112.393628","34.739214","14","880253 ","915971 ","4.6","1464 ","1486 ","184810 ","176630 "],["32.586011","110.910913","","Point","十堰/武当山","110.910913 ","32.586011","109","\"869","780\"","388923 ","110 ","","","9905 "],["28.797781","104.550293","","Point","宜宾/菜坝","104.550293","28.797781","117","827867 ","762935 ","3.5","2491 ","2920 ","8201 ","7925 "],["28.55513","121.42171","","Point","台州/路桥","121.42171","28.55513","123","821965 ","691442 ","14.1","6842 ","6720 ","6454 ","5658 "],["44.525407","129.630117","","Point","牡丹江/海浪","129.630117","44.525407","131","784991 ","694286 ","10.6","987 ","1162 ","6122 ","5534 "],["32.98143","112.61982","","Point","南阳/姜营","112.61982","32.98143","48","781563 ","612572 ","19.3","962 ","797 ","57600 ","48272 "],["30.319323","109.489899","","Point","恩施/许家坪","109.489899 ","30.319323","78","\"770","053\"","496148 ","395 ","\"1","202.00\"","989 "],["30.793442","106.168002","","Point","南充/高坪","106.168002","30.793442","55","752668 ","597489 ","158.4","2914 ","3107 ","47904 ","18542 "],["35.402531","119.331616","","Point","日照/山字河","119.331616 ","35.402531","60","\"737","741\"","408507 ","158 ","\"1","026.80\"","457 "],["29.72993","118.260793","","Point","黄山/屯溪","118.260793","29.72993","119","725948 ","604911 ","22.6","2291 ","2067 ","8063 ","6575 "],["36.52425","114.43457","","Point","邯郸","114.43457","36.52425","57","684081 ","462657 ","82.6","703 ","516 ","45328 ","24824 "],["46.821878","130.397278","","Point","佳木斯/东郊","130.397278","46.821878","127","667788 ","455337 ","49.5","1076 ","1081 ","6233 ","4170 "],["30.79449","108.43033","","Point","万州/五桥","108.43033","30.79449","75","656189 ","550727 ","30.7","2502 ","2247 ","22786 ","17438 "],["43.91837","115.96577","","Point","锡林浩特","115.96577","43.91837","81","648455 ","582194 ","-10.8","1526 ","2016 ","18756 ","21016 "],["40.057892","113.486772","","Point","大同/云冈","113.486772","40.057892","73","640095 ","544530 ","44.5","1704 ","1655 ","27666 ","19147 "],["27.97648","102.19101","","Point","西昌/青山","102.19101","27.97648","129","634794 ","469089 ","28.7","1428 ","1242 ","6166 ","4790 "],["42.149956","127.574848","","Point","白山/长白山","127.574848 ","42.149956","120","\"626","884\"","537709 ","14 ","118.5","176 ","7453 "],["26.853318","114.742637","","Point","井冈山","114.742637 ","26.853318","126","\"626","775\"","540865 ","7 ","\"2","219.60\"","3011 "],["29.348585","117.215386","","Point","景德镇/罗家","117.215386","29.348585","150","621880 ","543371 ","9.1","2120 ","1811 ","4638 ","4252 "],["46.719014","125.114334","","Point","大庆/萨尔图","125.114334 ","46.719014","140","\"621","053\"","489354 ","20 ","\"1","399.50\"","1347 "],["32.87722","115.743909","","Point","阜阳","115.743909","32.87722","86","610099 ","450308 ","98.2","533 ","547 ","16969 ","8560 "],["25.051671","99.165713","","Point","保山/云瑞","99.165713","25.051671","133","601307 ","410557 ","52.3","1128 ","835 ","6032 ","3960 "],["40.740649","114.938624","","Point","张家口/宁远","114.938624","40.740649","128","600658 ","351950 ","61.5","123 ","97 ","6173 ","3822 "],["36.646822","119.122362","","Point","潍坊","119.122362","36.646822","125","597763 ","540828 ","-2.2","26469 ","22186 ","6358 ","6499 "],["22.778142","100.973443","","Point","普洱/思茅","100.973443","22.778142","121","581680 ","487808 ","25.3","1079 ","814 ","7156 ","5713 "],["32.64239","117.02933","","Point","迪庆/香格里拉","117.02933","32.64239","124","570974 ","486640 ","25.3","957 ","874 ","6404 ","5112 "],["36.19175","113.08381","","Point","长治/王村","113.08381","36.19175","122","557142 ","741573 ","-27.3","465 ","719 ","6674 ","9175 "],["27.815915","114.401596","","Point","宜春/明月山","114.401596 ","27.815915","130","\"542","727\"","469976 ","21 ","370","275 ","6153 "],["37.506096","118.792213","","Point","东营/胜利","118.792213","37.506096","58","531381 ","377826 ","4.8","329 ","298 ","44240 ","42217 "],["40.136442","94.683541","","Point","敦煌","94.683541","40.136442","138","526779 ","496459 ","-5.7","510 ","518 ","5509 ","5839 "],["32.851353","103.685263","","Point","九寨/黄龙","103.685263","32.851353","148","523130 ","1122223 ","-51.8","196 ","138 ","4888 ","10139 "],["39.724471","117.999197","","Point","唐山/三女河","117.999197 ","39.724471","143","\"519","164\"","240999 ","81 ","\"1","261.00\"","837 "],["49.572574","117.339572","","Point","满洲里/西郊","117.339572","49.572574","136","501682 ","454371 ","5.2","1011 ","1665 ","5672 ","5390 "],["27.724193","118.010691","","Point","武夷山","118.010691 ","27.724193","135","\"493","460\"","455688 ","(0)","826.9","868 ","5832 "],["30.73817","117.690927","","Point","池州/九华山","117.690927 ","30.73817","141","\"475","132\"","355956 ","27 ","408.3","364 ","5430 "],["23.080913","113.075983","","Point","佛山/沙堤","113.075983","23.080913","163","471472 ","355904 ","21.4","243 ","445 ","3381 ","2784 "],["26.718615","112.621995","","Point","衡阳/南岳","112.621995","26.718615","146","470519 ","311549 ","36.2","602 ","882 ","4962 ","3644 "],["29.497729","94.580436","","Point","林芝/米林","94.580436","29.497729","144","467879 ","389530 ","23.7","1943 ","1654 ","5256 ","4248 "],["30.580776","117.055412","","Point","安庆","117.055412","30.580776","147","459170 ","325634 ","25.9","1434 ","1418 ","4904 ","3894 "],["39.79159","106.80817","","Point","乌海","106.80817","39.79159","132","454296 ","339824 ","49.5","599 ","988 ","6083 ","4069 "],["28.916307","111.643672","","Point","常德/桃花源","111.643672 ","28.916307","37","\"438","362\"","413484 ","(6)","368.7","258 ","83847 "],["39.815459","98.340651","","Point","嘉峪关","98.340651 ","39.815459","151","\"434","483\"","399401 ","(5)","\"1","616.10\"","1704 "],["26.971508","107.989467","","Point","凯里/黄平","107.989467","26.971508","112","425155 ","94137 ","61.7","1 ","","9476 ","5862 "],["31.128664","107.434035","","Point","达州/河市","107.434035","31.128664","149","424496 ","402691 ","4.1","1464 ","1475 ","4752 ","4563 "],["26.25399","105.87646","","Point","安顺/黄果树105.876460 ","26.25399","137","\"421","517\"","250798 ","24 ","897.2","958 ","5652 ","4545 "],["33.150225","107.334352","","Point","汉中/城固","107.334352","33.150225","106","414361 ","195178 ","403.2","631 ","402 ","10753 ","2137 "],["47.25401","123.92377","","Point","齐齐哈尔/三家子","123.923770 ","47.25401","159","\"403","008\"","322120 ","20 ","582.3","833 ","3556 "],["23.897171","100.086549","","Point","临沧","100.086549","23.897171","154","399406 ","353467 ","22.4","751 ","670 ","3918 ","3200 "],["26.362772","115.371323","","Point","梅县/长岗岌","115.371323 ","26.362772","142","\"397","857\"","335974 ","6 ","126.9","194 ","5414 "],["28.84208","105.38312","","Point","泸州/蓝田","105.38312","28.84208","153","395575 ","985108 ","-60","1062 ","3293 ","3996 ","9992 "],["45.4683","84.95947","","Point","克拉玛依","84.95947","45.4683","61","389677 ","272585 ","3.6","281 ","211 ","43089 ","41598 "],["26.605323","104.980987","","Point","六盘水/月照","104.980987","26.605323","139","385141 ","227958 ","40.7","48 ","51 ","5484 ","3898 "],["35.80088","107.61048","","Point","庆阳","107.61048","35.80088","93","337346 ","324790 ","-23.3","49 ","38 ","14749 ","19234 "],["36.63886","109.55704","","Point","延安/二十里堡","109.55704","36.63886","167","333724 ","236909 ","36.4","346 ","217 ","3119 ","2287 "],["39.85273","119.47154","","Point","秦皇岛/北戴河","119.471540 ","39.85273","110","\"328","473\"","231240 ","176 ","506.2","426 ","9699 "],["41.033569","113.135849","","Point","乌兰察布/集宁","113.135849","41.033569","145","324128 ","66507 ","329.8","3 ","","5171 ","1203 "],["19.155447","110.557769","","Point","琼海/博鳌","110.557769","19.155447","116","316246 ","10696 ","622.9","52 ","2 ","8523 ","1179 "],["42.8184","93.76535","","Point","哈密","93.76535","42.8184","158","299625 ","163528 ","66.4","483 ","410 ","3693 ","2220 "],["41.68274","82.87683","","Point","库车/龟兹","82.87683","41.68274","157","295001 ","273695 ","17.8","380 ","293 ","3745 ","3178 "],["29.5145","108.834","","Point","黔江/武陵山","108.834000 ","29.5145","165","\"288","749\"","153443 ","59 ","120.5","78 ","3320 "],["40.8859","107.701086","","Point","巴彦淖尔/天吉泰","107.701086 ","40.8859","152","\"282","874\"","273136 ","(2)","595.6","891 ","3997 "],["27.3244","103.75462","","Point","昭通","103.754620 ","27.3244","160","\"280","639\"","224051 ","17 ","249.4","84 ","3470 "],["37.528343","111.173422","","Point","吕梁/大武","111.173422","37.528343","162","275786 ","213797 ","17.2","43 ","21 ","3406 ","2906 "],["26.534456","101.799265","","Point","攀枝花/保安营","101.799265 ","26.534456","172","\"272","926\"","228508 ","15 ","\"1","345.70\"","1154 "],["32.39271","105.70477","","Point","广元/盘龙","105.70477","32.39271","89","265256 ","236664 ","518.9","320 ","293 ","15397 ","2488 "],["32.839047","97.033822","","Point","玉树/巴塘","97.033822","32.839047","169","263706 ","181215 ","48.6","722 ","387 ","3106 ","2090 "],["38.413956","112.729334","","Point","忻州/五台山","112.729334 ","38.413956","155","\"261","146\"","111585 ","115 ","25.8","11 ","3864 "],["36.099706","111.616682","","Point","临汾/乔李","111.616682","36.099706","168","254290 ","151093 ","43.3","780 ","175 ","3116 ","2174 "],["41.089196","121.153656","","Point","锦州/锦州湾","121.153656 ","41.089196","183","\"232","715\"","158154 ","33 ","911.8","829 ","2110 "],["30.551642","97.114994","","Point","昌都/邦达","97.114994","30.551642","178","231235 ","225666 ","2.2","714 ","976 ","2252 ","2204 "],["45.299703","131.208834","","Point","鸡西/兴凯湖","131.208834 ","45.299703","174","\"222","125\"","190754 ","32 ","257","313 ","2752 "],["40.630024","122.424715","","Point","营口/兰旗","122.424715","40.630024","177","205528 ","115468 ","62.3","188 ","26 ","2459 ","1515 "],["28.96474","118.88025","","Point","衢州","118.88025","28.96474","192","202620 ","208219 ","-2.4","602 ","639 ","1652 ","1692 "],["41.095239","122.879127","","Point","鞍山/腾鳌","122.879127","41.095239","181","199279 ","152647 ","17.8","16 ","17 ","2234 ","1896 "],["29.307956","100.068154","","Point","稻城/亚丁","100.068154","29.307956","187","198952 ","186350 ","-2.5","268 ","206 ","1930 ","1980 "],["40.03342","124.28688","","Point","丹东/浪头","124.28688","40.03342","188","198498 ","211516 ","-16.6","1218 ","1623 ","1901 ","2280 "],["26.400633","117.792475","","Point","三明/沙县","117.792475","26.400633","184","198272 ","69734 ","36.8","374 ","81 ","2095 ","1531 "],["27.44155","109.70564","","Point","怀化/芷江","109.70564","27.44155","161","180497 ","115518 ","75.5","2 ","10 ","3416 ","1946 "],["34.555065","105.868786","","Point","天水/麦积山","105.868786 ","34.555065","164","\"178","227\"","109207 ","38 ","52.3","38 ","3340 "],["36.437993","94.772246","","Point","格尔木","94.772246 ","36.437993","180","\"172","266\"","149056 ","13 ","861.9","678 ","2238 "],["37.57652","105.14125","","Point","中卫/香山","105.14125","37.57652","62","159744 ","102834 ","5.7","127 ","90 ","42321 ","40046 "],["36.014478","106.285358","","Point","固原/六盘山","106.285358 ","36.014478","97","\"157","183\"","107358 ","63 ","15.1","8 ","13241 "],["28.727072","100.571465","","Point","阿尔山/伊尔施","100.571465 ","28.727072","173","\"155","187\"","105043 ","60 ","384.3","443 ","2758 "],["38.495919","102.332214","","Point","金昌/金川","102.332214","38.495919","185","152606 ","114797 ","-40.7","103 ","139 ","2075 ","3502 "],["50.17957","127.3203","","Point","黑河","127.3203","50.17957","175","150692 ","140752 ","0.5","72 ","65 ","2698 ","2684 "],["43.031421","89.102427","","Point","吐鲁番/交河","89.102427","43.031421","176","147653 ","55373 ","94.3","1157 ","101 ","2642 ","1360 "],["50.37518","124.11834","","Point","加格达奇","124.11834","50.37518","170","147417 ","132221 ","7.4","50 ","37 ","2977 ","2772 "],["41.127874","118.080298","","Point","承德/普宁","118.080298","41.127874","199","146979 ","","","3 ","","1352 ","undefined"],["28.419874","117.899436","","Point","上饶/三清山","117.899436 ","28.419874","193","\"146","655\"","","","6.6","","1634 "],["25.690503","116.76488","","Point","连城/冠豸山","116.764880 ","25.690503","194","\"142","794\"","115931 ","(0)","224.5","96 ","1604 "],["38.901196","100.603731","","Point","张掖/甘州","100.603731","38.901196","196","138292 ","117637 ","51.8","137 ","90 ","1576 ","1576 "],["41.510985","120.441863","","Point","朝阳","120.441863","41.510985","44","136221 ","132273 ","-15.6","15 ","85 ","70461 ","83469 "],["47.731753","128.893249","","Point","伊春/林都","128.893249","47.731753","198","135326 ","122081 ","10.5","53 ","44 ","1407 ","1273 "],["44.898276","82.303703","","Point","博乐/阿拉山口","82.303703","44.898276","51","134269 ","129030 ","2.5","113 ","55 ","52964 ","51666 "],["38.746409","105.644472","","Point","阿拉善左旗/巴彦浩特","105.644472","38.746409","134","121884 ","56690 ","109.2","0 ","","5997 ","2866 "],["48.22439","87.00544","","Point","布尔津/喀纳斯","87.00544","48.22439","166","121284 ","99574 ","182.9","4 ","3 ","3126 ","1105 "],["26.3413","111.6179","","Point","永州/零陵","111.6179","26.3413","195","120824 ","112039 ","-1.4","15 ","49 ","1594 ","1616 "],["34.813611","102.68478","","Point","甘南/夏河","102.68478","34.813611","189","118282 ","91556 ","31.3","304 ","249 ","1888 ","1438 "],["30.140162","101.741137","","Point","甘孜/康定","101.741137","30.140162","191","116324 ","133669 ","-2.6","48 ","13 ","1782 ","1830 "],["23.735025","106.907509","","Point","百色/巴马","106.907509","23.735025","197","109918 ","99489 ","-0.8","6 ","","1522 ","1534 "],["23.603423","104.346325","","Point","文山/普者黑","104.346325","23.603423","111","108571 ","91699 ","751","291 ","254 ","9582 ","1126 "],["47.75357","88.09164","","Point","阿勒泰","88.091640 ","47.75357","171","\"105","301\"","298486 ","(40)","87.8","184 ","2917 "],["42.056477","125.762534","","Point","通化/三源浦","125.762534 ","42.056477","202","\"104","234\"","74831 ","(5)","","0 ","1106 "],["27.800021","107.253395","","Point","遵义/茅台","107.253395","27.800021","201","101563 ","","","","","1188 ","undefined"],["25.44036","107.96531","","Point","黔南州/荔波","107.96531","25.44036","186","101462 ","46242 ","64","1 ","1 ","1984 ","1210 "],["26.31713","109.15841","","Point","黎平","109.15841","26.31713","179","93382 ","47358 ","71.8","12 ","1 ","2250 ","1310 "],["43.4305","83.3795","","Point","那拉提","83.379500 ","43.4305","203","\"84","491\"","92634 ","(7)","105.5","44 ","1092 "],["52.947719","122.345831","","Point","漠河/古莲","122.345831","52.947719","190","83801 ","72505 ","5.5","77 ","45 ","1872 ","1774 "],["26.797136","110.64856","","Point","邵阳/武冈","110.64856","26.797136","206","82232 ","","","2 ","","937 ","undefined"],["23.267237","99.365303","","Point","沧源/佤山","99.365303","23.267237","213","81945 ","2773 ","3272.7","24 ","","742 ","22 "],["37.133107","97.262543","","Point","海西/德令哈","97.262543 ","37.133107","208","\"81","661\"","62961 ","27 ","228.5","64 ","926 "],["44.305886","86.041075","","Point","石河子/花园","86.041075","44.305886","200","80949 ","38646 ","68.1","111 ","3 ","1210 ","720 "],["46.67072","83.34263","","Point","塔城","83.34263","46.67072","210","74724 ","138353 ","-50.1","18 ","22 ","858 ","1718 "],["30.132689","122.769531","","Point","抚远/东极","122.769531","30.132689","211","65148 ","62509 ","1.9","2 ","1 ","852 ","836 "],["29.352523","89.318596","","Point","日喀则","89.318596 ","29.352523","214","\"64","539\"","48132 ","22 ","311.4","257 ","739 "],["22.335874","99.589631","","Point","澜沧/景迈","99.589631","22.335874","218","61407 ","","","1 ","","584 ","undefined"],["47.747101","122.831184","","Point","扎兰屯/成吉思汗","122.831184","47.747101","205","56675 ","432 ","13150","0 ","","1060 ","8 "],["38.14462","85.53609","","Point","且末","85.53609","38.14462","215","50762 ","1464 ","4437.5","5 ","","726 ","16 "],["16.824674","112.33768","","Point","三沙/永兴","112.33768","16.824674","216","49810 ","759 ","4375","10 ","","716 ","16 "],["27.65296","100.80829","","Point","宁蒗/泸沽湖","100.808290 ","27.65296","219","\"47","439\"","40090 ","11 ","26","2 ","454 "],["43.629272","122.292213","","Point","霍林河","122.292213 ","43.629272","204","\"47","010\"","","","0.2","","1068 "],["36.894039","98.786598","","Point","富蕴/可可托海","98.786598","36.894039","182","41796 ","38805 ","222.3","37 ","8 ","2224 ","690 "],["38.200017","90.841982","","Point","海西/花土沟","90.841982 ","38.200017","220","\"38","935\"","24082 ","85 ","6.9","","451 "],["45.505303","123.023483","","Point","白城/长安","123.023483","45.505303","221","31439 ","","","0 ","","438 ","undefined"],["23.45351","111.25557","","Point","梧州/长州岛","111.255570 ","23.45351","32","\"27","475\"","70639 ","3 ","7.5","21 ","98260 "],["44.94196","124.559594","","Point","松原/查干湖","124.559594 ","44.94196","225","\"24","231\"","","","0.7","","386 "],["40.625729","107.056274","","Point","额济纳旗/桃来","107.056274","40.625729","209","23843 ","17264 ","55.1","0 ","0 ","881 ","568 "],["24.71394","107.842501","","Point","河池/金城江","107.842501 ","24.71394","223","\"14","083\"","30299 ","(37)","","","419 "],["32.529552","102.354863","","Point","阿坝/红原","102.354863","32.529552","227","12541 ","24713 ","-39.3","","","210 ","346 "],["47.106369","132.670313","","Point","建三江/湿地","132.670313","47.106369","228","11695 ","","","","","136 ","undefined"],["31.672834","110.429298","","Point","神农架/红坪","110.429298","31.672834","226","10299 ","18074 ","-7.5","","","322 ","348 "],["39.243991","122.668699","","Point","长海/大长山岛","122.668699","39.243991","224","2958 ","3392 ","-14.1","","","401 ","467 "],["32.70707","108.93981","","Point","安康","108.93981","32.70707","79","","","82.1","","","19485 ","10700 "]]}}

const charts_content = {
    "fileName": "民航数据CSV",
    "type": "GEOJSON",
    "lineNumber": null,
    "content": "{\"type\":\"FeatureCollection\",\"crs\":{\"type\":\"name\",\"properties\":{\"name\":\"urn:ogc:def:crs:OGC:1.3:CRS84\"}},\"features\":[{\"type\":\"Feature\",\"properties\":{\"机场\":\"北京/首都\",\"X坐标\":\"116.588918\",\"Y坐标\":\"40.071080\",\"名次\":\"1\",\"2017旅客吞吐量（人次）\":\"95,786,296\",\"2016旅客吞吐量（人次）\":\"94,393,454\",\"同比增速%\":\"-1.5\",\"2017货邮吞吐量（吨）\":\"2,029,583.6\",\"2016货邮吞吐量（吨）\":\"1,943,159.7\",\"2017起降架次（架次）\":\"597,259\",\"2016起降架次（架次）\":\"606,081\"},\"geometry\":{\"type\":\"Point\",\"coordinates\":[116.58891800000002,40.071079999999995]}},{\"type\":\"Feature\",\"properties\":{\"机场\":\"上海/浦东\",\"X坐标\":\"121.812361 \",\"Y坐标\":\"31.093992 \",\"名次\":\"2\",\"2017旅客吞吐量（人次）\":\"70,001,237 \",\"2016旅客吞吐量（人次）\":\"66,002,414 \",\"同比增速%\":\"3.5 \",\"2017货邮吞吐量（吨）\":\"3,824,279.9 \",\"2016货邮吞吐量（吨）\":\"3,440,279.7 \",\"2017起降架次（架次）\":\"496,774 \",\"2016起降架次（架次）\":\"479,902 \"},\"geometry\":{\"type\":\"Point\",\"coordinates\":[121.812361,31.093992000000014]}}]}"
}


const datas_beijing = {
    "type": "FeatureCollection",
    "features": [
        {
            "geometry": {
                "coordinates": [
                    [
                        [
                            116.720245265,
                            39.6245367190853
                        ],
                        [
                            116.716514385,
                            39.6241937840854
                        ],
                        [
                            116.71657379,
                            39.6229782990854
                        ],
                        [
                            116.716596995,
                            39.6225376940854
                        ],
                        [
                            116.716593475,
                            39.6222269590853
                        ],
                        [
                            116.70582801,
                            39.6187705190854
                        ],
                        [
                            116.720245265,
                            39.6245367190853
                        ]
                    ]
                ],
                "type": "Polygon"
            },
            "properties": {
                "Field_SmUserID": 0,
                "Name": "北京市",
                "UserID": 0
            },
            "type": "Feature"
        }
    ]
}
const searchGeocoding = [
    {
        "score": 85,
        "address": "北京市西城区槐柏树街9号北京小学",
        "location": {
            "x": 116.360603320322,
            "y": 39.89671784607
        },
        "filters": [
            "北京市",
            "西城区"
        ]
    },
    {
        "score": 82,
        "address": "北京市昌平区回龙观镇农学院社区居委会北京农学院",
        "location": {
            "x": 116.308601712659,
            "y": 40.0932558374159
        },
        "filters": [
            "北京市",
            "昌平区"
        ]
    },
    {
        "score": 80,
        "address": "北京市顺义区空港开发区裕东路3号北京人文大学",
        "location": {
            "x": 116.55819420026,
            "y": 40.099386412776
        },
        "filters": [
            "北京市",
            "顺义区"
        ]
    },
    {
        "score": 80,
        "address": "北京市通州区富河大街1号北京物资学院",
        "location": {
            "x": 116.638298326162,
            "y": 39.9277205046446
        },
        "filters": [
            "北京市",
            "通州区"
        ]
    },
    {
        "score": 80,
        "address": "北京市通州区宋庄镇丛林庄园北京中加学校",
        "location": {
            "x": 116.693505769065,
            "y": 39.9457949533308
        },
        "filters": [
            "北京市",
            "通州区"
        ]
    },
    {
        "score": 80,
        "address": "北京市通州区马厂97号北京胸科医院",
        "location": {
            "x": 116.652862974063,
            "y": 39.9228297488784
        },
        "filters": [
            "北京市",
            "通州区"
        ]
    },
]
///web/maps/1649097980/map.json 
const search_mapjson = {
    "extent": {
        "leftBottom": {
            "x": -20037508.3427892,
            "y": -20037508.3427891
        },
        "rightTop": {
            "x": 20037508.3427892,
            "y": 20037508.3427891
        }
    },
    "level": 5,
    "center": {
        "x": 11810617.9363554,
        "y": 4275239.3340175
    },
    "baseLayer": {
        "layerType": "TILE",
        "name": "China",
        "url": "http://support.supermap.com.cn:8090/iserver/services/map-china400/rest/maps/China"
    },
    "layers": [
        {
            "layerType": "UNIQUE",
            "visible": true,
            "themeSetting": {
                "themeField": "2016起降架次（架次）",
                "customSettings": {},
                "colors": [
                    "#D53E4F",
                    "#FC8D59",
                    "#FEE08B",
                    "#FFFFBF",
                    "#E6F598",
                    "#99D594",
                    "#3288BD"
                ]
            },
            "name": "民航数",
            "featureType": "POINT",
            "style": {
                "strokeWidth": 1,
                "fillColor": "#3288bd",
                "fillOpacity": 0.9,
                "radius": 7,
                "strokeColor": "#ffffff",
                "type": "BASIC_POINT",
                "strokeOpacity": 1
            },
            "projection": "EPSG:4326",
            "enableFields": [
                "机场",
                "X坐标",
                "Y坐标",
                "名次",
                "2017旅客吞吐量（人次）",
                "2016旅客吞吐量（人次）",
                "同比增速%",
                "2017货邮吞吐量（吨）",
                "2016货邮吞吐量（吨）",
                "2017起降架次（架次）",
                "2016起降架次（架次）"
            ],
            "dataSource": {
                "type": "PORTAL_DATA",
                "serverId": "1920557079"
            }
        }
    ],
    "description": "",
    "projection": "EPSG:3857",
    "title": "unique_民航数据",
    "version": "1.0"
}

//search restdata
const fieldsJson = 
    [{"isRequired":true,"defaultValue":"","name":"SmID","caption":"SmID","type":"INT32","maxLength":4,"isZeroLengthAllowed":true,"isSystemField":true},{"isRequired":true,"defaultValue":"0","name":"SmSdriW","caption":"SmSdriW","type":"SINGLE","maxLength":4,"isZeroLengthAllowed":true,"isSystemField":true},{"isRequired":true,"defaultValue":"0","name":"SmSdriN","caption":"SmSdriN","type":"SINGLE","maxLength":4,"isZeroLengthAllowed":true,"isSystemField":true},{"isRequired":true,"defaultValue":"0","name":"SmSdriE","caption":"SmSdriE","type":"SINGLE","maxLength":4,"isZeroLengthAllowed":true,"isSystemField":true},{"isRequired":true,"defaultValue":"0","name":"SmSdriS","caption":"SmSdriS","type":"SINGLE","maxLength":4,"isZeroLengthAllowed":true,"isSystemField":true},{"isRequired":true,"defaultValue":"0","name":"SmUserID","caption":"SmUserID","type":"INT32","maxLength":4,"isZeroLengthAllowed":true,"isSystemField":false},{"isRequired":true,"defaultValue":"0","name":"SmArea","caption":"SmArea","type":"DOUBLE","maxLength":8,"isZeroLengthAllowed":true,"isSystemField":true},{"isRequired":true,"defaultValue":"0","name":"SmPerimeter","caption":"SmPerimeter","type":"DOUBLE","maxLength":8,"isZeroLengthAllowed":true,"isSystemField":true},{"isRequired":false,"defaultValue":"0","name":"SmGeometrySize","caption":"SmGeometrySize","type":"INT32","maxLength":4,"isZeroLengthAllowed":true,"isSystemField":true},{"isRequired":true,"defaultValue":"-1","name":"SmGeoPosition","caption":"SmGeoPosition","type":"INT64","maxLength":8,"isZeroLengthAllowed":true,"isSystemField":true},{"isRequired":false,"defaultValue":"","name":"COUNTRY","caption":"Country","type":"TEXT","maxLength":50,"isZeroLengthAllowed":true,"isSystemField":false},{"isRequired":false,"defaultValue":"","name":"CAPITAL","caption":"Capital","type":"TEXT","maxLength":50,"isZeroLengthAllowed":true,"isSystemField":false},{"isRequired":false,"defaultValue":"","name":"ColorID","caption":"ColorID","type":"INT32","maxLength":4,"isZeroLengthAllowed":true,"isSystemField":false},{"isRequired":false,"defaultValue":"","name":"COLOR_MAP","caption":"COLOR_MAP","type":"TEXT","maxLength":1,"isZeroLengthAllowed":true,"isSystemField":false},{"isRequired":false,"defaultValue":"","name":"SQKM","caption":"SQKM","type":"DOUBLE","maxLength":8,"isZeroLengthAllowed":true,"isSystemField":false},{"isRequired":false,"defaultValue":"","name":"SQMI","caption":"SQMI","type":"DOUBLE","maxLength":8,"isZeroLengthAllowed":true,"isSystemField":false},{"isRequired":false,"defaultValue":"","name":"POP_1994","caption":"Pop_1994","type":"DOUBLE","maxLength":8,"isZeroLengthAllowed":true,"isSystemField":false},{"isRequired":false,"defaultValue":"","name":"CONTINENT","caption":"CONTINENT","type":"TEXT","maxLength":20,"isZeroLengthAllowed":true,"isSystemField":false}]


module.exports = { fakeDataServiceResult, fakeMapServiceResult, fakeAddressMatch, featureResults, datas, datasources, datasets, queryResults, fakeLandUse, chartResult, datas_chart, iportal_content, datas_mapjson, localSearch, charts_content, searchGeocoding, search_mapjson, fieldsJson, datas_beijing, portal_data,portal_data1, chart_data, prj_data, dataset_data,datas_charts };