<script setup lang="ts">
import TextList from '../text-list.vue'
import '../style'

const content = [
  {
    站台: '漠河',
    省份: '黑龙江1',
    海拔: '296',
    平均最低气温: '-47',
    最热七天气温: '29'
  },
  {
    站台: '塔河',
    省份: '黑龙江2',
    海拔: '357.4',
    平均最低气温: '-42',
    最热七天气温: '29'
  },
  {
    站台: '呼玛',
    省份: '黑龙江3',
    海拔: '177.4',
    平均最低气温: '-42',
    最热七天气温: '30'
  },
  {
    站台: '额尔古纳右旗',
    省份: '内蒙古1',
    海拔: '581.4',
    平均最低气温: '-42',
    最热七天气温: '29'
  },
  {
    站台: '图里河',
    省份: '内蒙古2',
    海拔: '732.6',
    平均最低气温: '-46',
    最热七天气温: '27'
  },
  {
    站台: '黑河',
    省份: '黑龙江4',
    海拔: '166.4',
    平均最低气温: '-37',
    最热七天气温: '30'
  },
  {
    站台: '满洲里',
    省份: '内蒙古3',
    海拔: '661.7',
    平均最低气温: '-37',
    最热七天气温: '30'
  },
  {
    站台: '海拉尔',
    省份: '内蒙古4',
    海拔: '610',
    平均最低气温: '-40',
    最热七天气温: '30'
  },
  {
    站台: '小二沟',
    省份: '内蒙古5',
    海拔: '286',
    平均最低气温: '-42',
    最热七天气温: '30'
  },
  {
    站台: '嫩江',
    省份: '黑龙江5',
    海拔: '242.2',
    平均最低气温: '-40',
    最热七天气温: '30'
  }
]
</script>
<template>
  <TextList 
    :content="content"
    :header="['站台', '省份', '海拔', '平均最低气温', '最热七天气温']"
    :fields="['站台', '省份', '海拔', '平均最低气温', '最热七天气温']"
    fontSize="16px"
    :autoRolling="false"
    :rows="6"
    :autoResize="true"
  />
</template>
<style>
.sm-component-text-list {
  width: 500px !important;
  height: 300px !important;
}
</style>
